org/multiselect_library.org
* Export configuration                                             :noexport:

  #+SETUPFILE: org-settings.org
  #+TITLE:     {{{msjs}}} --- ~multiselect_library.org~
  #+AUTHOR:    Jaakko Järvi
  #+EMAIL:     jarvij@gmail.com
  #+DATE:      

* Introduction
  
  This document describes the implementation of the /{{{msjs}}}/
  library.  {{{msjs}}} encapsulates the state of maintaining
  selections of elements in indexable collections. It helps in
  implementing multi-selection in varied contexts in GUIs.  The
  implementation faithfully follows the abstractions described in the
  manuscript /One Way to Select Many/ by Jaakko Järvi and Sean Parent.

** Definitions

   \( 
   \newcommand{\true}{\mathsf{true}} 
   \newcommand{\false}{\mathsf{false}}
   \newcommand{\selset}{{\mathbf{2}}}
   \newcommand{\esp}[2]{\mathsf{op}^{#1}_{#2}} 
   \newcommand{\inds}{\mathsf{s\_dom}}
   \) 
  To understand the implementation, it is useful to know some of the
  definitions from the manuscript. The descriptions here are terse,
  the manuscript gives more thorough explanations.
   
  - The library assumes that for any collection of elements $M$, there
    is an indexed family $x: I \to M$ and subsequently only deals with
    the index set $I$.
 
  - Which elements of a collection are selected and which are not is
    represented by a /selection mapping/ $s: I \to \selset$, where
    $\selset = \{\true, \false \}$; $s(i) = \true$ indicates that the
    element $x_i$ is selected and $s(i) = \false$ that it is not.

  - Let $x: I \to M$ be a collection, $J \subseteq I$, and $f: \selset
    \to \selset$ a mapping.  $J$ and $f$ (uniquely) determine a
    /primitive selection operation/:

    \begin{equation*}
    \esp{f}{J}: (I \to \selset) \to (I \to \selset), s \mapsto
    \lambda i.\left\{ 
      \begin{array}{ll} 
        f(s(i)), & i \in J\\
        s(i), & i \notin J
      \end{array}
    \right.
    \end{equation*}

    The function $f$ in $\esp{f}{J}$ is the /selection function/ and
    the set $J$ the /selection domain/. There are four possible
    selection functions: $\lambda x. x$, $\lambda x. \neg x$,
    $\lambda x.\true$, and $\lambda x.\false$. The selection domain
    is the set of indices to which the selection function applies.

A primitive selection operation $\esp{f}{J}$ can be applied to a
selection mapping $s$ to obtain a new selection mapping
$\esp{f}{J}(s)$.  Selection operations compose: starting from
the "no elements selected" selection mapping $e: I \to \selset{}, i
\mapsto \false$, the selection mapping that results after applying a series
of primitive selection operations $\esp{f_1}{J_1}, \esp{f_2}{J_2},
\ldots, \esp{f_n}{J_n}$ is

\begin{equation*}
  (\esp{f_n}{J_n} \circ \esp{f_{n-1}}{J_{n-1}} \circ \ldots \circ \esp{f_1}{J_1})(e).
\end{equation*}

In a nutshell, the library operates as follows.  The selection mapping
of the elements of a collection is maintained in two parts: (1) a
"base" selection mapping $s_b$ and (2) a composition of selection
operations $\mathit{ops}$. The current selection mapping is then
obtained as $\mathit{ops}(s_b)$.  In other words, the element $x_i$ is
selected if $\mathit{ops}(s_b)(i) = \true$, and not selected if it is
$\false$.

Various selection commands, triggered by mouse or keyboard events,
impact the selection mapping by adding new selection
operations to $\mathit{ops}$, or by replacing or removing the most
recently added operation(s). The least recently added operation can also
be removed with its effect "baked" into the base selection mapping
permanently. This baking operation changes both $\mathit{ops}$ to a
new composition $\mathit{ops}'$ and $s_b$ to a new base selection
mapping $s'_b$, but the current selection mapping observed by the user
does not change. That is, $\mathit{ops}(s_b) = \mathit{ops}'(s'_b)$.

User commands indicate points in the /mouse coordinate space/.  It is
the task of a /selection geometry/ to interpret how sequences of these
points correspond to element indices. For this, a selection geometry
defines two functions: ~m2v~ to translate a single point in the mouse
coordinate space into a point in the /selection space/, and
~selectionDomain~ to translate a path of selection space points, the
/selection path/, into a set of element indices, the /selection
domain/. Each user command modifies the current selection path. The
first element of the a selection path is called the /anchor/, the last
the /active end/. 


** Code conventions

Member variables and functions that start with an underscore are
intended to be private to the class they are defined in. Client code
should not refer to such members.

** Utility functions

