dist-docs/library/multiselect_library.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MultiselectJS &#x2014; <code>multiselect_library.org</code></title>
<!-- 2015-08-21 Fri 20:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jaakko Järvi" />
</head>
<body>
<div id="content">
<h1 class="title">MultiselectJS &#x2014; <code>multiselect_library.org</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Definitions</a></li>
<li><a href="#sec-1-2">1.2. Code conventions</a></li>
<li><a href="#sec-1-3">1.3. Utility functions</a>
<ul>
<li><a href="#sec-maps-and-sets">1.3.1. Maps and sets</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-selection-functions">2. Selection functions</a></li>
<li><a href="#sec-selection-mapping">3. Selection mapping</a></li>
<li><a href="#sec-4">4. Selection operations</a></li>
<li><a href="#sec-composition">5. Composition of selection operations</a></li>
<li><a href="#sec-6">6. Selection state</a>
<ul>
<li><a href="#sec-6-1">6.1. Accessing the selection state of elements</a></li>
<li><a href="#sec-6-2">6.2. Click functions</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. Click</a></li>
<li><a href="#sec-6-2-2">6.2.2. Command-click</a></li>
<li><a href="#sec-6-2-3">6.2.3. Shift-click</a></li>
<li><a href="#sec-6-2-4">6.2.4. Call selection domain</a></li>
<li><a href="#sec-6-2-5">6.2.5. Flush</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. Manipulating the selection path</a></li>
<li><a href="#sec-6-4">6.4. Analyzing elements under point</a></li>
<li><a href="#sec-6-5">6.5. Empty pairs</a></li>
<li><a href="#sec-6-6">6.6. Baking</a></li>
<li><a href="#sec-undo-redo">6.7. Undo and redo operations</a></li>
<li><a href="#sec-6-8">6.8. Selecting and deselecting with a predicate</a></li>
<li><a href="#sec-6-9">6.9. Set geometry</a></li>
<li><a href="#sec-access-cursor-data">6.10. Access functions</a></li>
<li><a href="#sec-6-11">6.11. Keyboard operations</a></li>
</ul>
</li>
<li><a href="#sec-selection-geometries">7. Selection geometries</a></li>
<li><a href="#sec-8">8. Events</a>
<ul>
<li><a href="#sec-8-1">8.1. Detecting mouse/keyboard events</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Library API</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes the implementation of the <i>MultiselectJS</i>
library.  MultiselectJS encapsulates the state of maintaining
selections of elements in indexable collections. It helps in
implementing multi-selection in varied contexts in GUIs.  The
implementation faithfully follows the abstractions described in the
manuscript <i>One Way to Select Many</i> by Jaakko Järvi and Sean Parent.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Definitions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
 \( 
   \newcommand{\true}{\mathsf{true}} 
   \newcommand{\false}{\mathsf{false}}
   \newcommand{\selset}{{\mathbf{2}}}
   \newcommand{\esp}[2]{\mathsf{op}^{#1}_{#2}} 
   \newcommand{\inds}{\mathsf{s\_dom}}
   \) 
To understand the implementation, it is useful to know some of the
definitions from the manuscript. The descriptions here are terse,
the manuscript gives more thorough explanations.
</p>

<ul class="org-ul">
<li>The library assumes that for any collection of elements \(M\), there
is an indexed family \(x: I \to M\) and subsequently only deals with
the index set \(I\).</li>

<li>Which elements of a collection are selected and which are not is
represented by a <i>selection mapping</i> \(s: I \to \selset\), where
\(\selset = \{\true, \false \}\); \(s(i) = \true\) indicates that the
element \(x_i\) is selected and \(s(i) = \false\) that it is not.</li>

<li><p>
Let \(x: I \to M\) be a collection, \(J \subseteq I\), and \(f: \selset
    \to \selset\) a mapping.  \(J\) and \(f\) (uniquely) determine a
<i>primitive selection operation</i>:
</p>

\begin{equation*}
\esp{f}{J}: (I \to \selset) \to (I \to \selset), s \mapsto
\lambda i.\left\{ 
  \begin{array}{ll} 
    f(s(i)), & i \in J\\
    s(i), & i \notin J
  \end{array}
\right.
\end{equation*}

<p>
The function \(f\) in \(\esp{f}{J}\) is the <i>selection function</i> and
the set \(J\) the <i>selection domain</i>. There are four possible
selection functions: \(\lambda x. x\), \(\lambda x. \neg x\),
\(\lambda x.\true\), and \(\lambda x.\false\). The selection domain
is the set of indices to which the selection function applies.
</p></li>
</ul>

<p>
A primitive selection operation \(\esp{f}{J}\) can be applied to a
selection mapping \(s\) to obtain a new selection mapping
\(\esp{f}{J}(s)\).  Selection operations compose: starting from
the &ldquo;no elements selected&rdquo; selection mapping \(e: I \to \selset{}, i
\mapsto \false\), the selection mapping that results after applying a series
of primitive selection operations \(\esp{f_1}{J_1}, \esp{f_2}{J_2},
\ldots, \esp{f_n}{J_n}\) is
</p>

\begin{equation*}
  (\esp{f_n}{J_n} \circ \esp{f_{n-1}}{J_{n-1}} \circ \ldots \circ \esp{f_1}{J_1})(e).
\end{equation*}

<p>
In a nutshell, the library operates as follows.  The selection mapping
of the elements of a collection is maintained in two parts: (1) a
&ldquo;base&rdquo; selection mapping \(s_b\) and (2) a composition of selection
operations \(\mathit{ops}\). The current selection mapping is then
obtained as \(\mathit{ops}(s_b)\).  In other words, the element \(x_i\) is
selected if \(\mathit{ops}(s_b)(i) = \true\), and not selected if it is
\(\false\).
</p>

<p>
Various selection commands, triggered by mouse or keyboard events,
impact the selection mapping by adding new selection
operations to \(\mathit{ops}\), or by replacing or removing the most
recently added operation(s). The least recently added operation can also
be removed with its effect &ldquo;baked&rdquo; into the base selection mapping
permanently. This baking operation changes both \(\mathit{ops}\) to a
new composition \(\mathit{ops}'\) and \(s_b\) to a new base selection
mapping \(s'_b\), but the current selection mapping observed by the user
does not change. That is, \(\mathit{ops}(s_b) = \mathit{ops}'(s'_b)\).
</p>

<p>
User commands indicate points in the <i>mouse coordinate space</i>.  It is
the task of a <i>selection geometry</i> to interpret how sequences of these
points correspond to element indices. For this, a selection geometry
defines two functions: <code>m2v</code> to translate a single point in the mouse
coordinate space into a point in the <i>selection space</i>, and
<code>selectionDomain</code> to translate a path of selection space points, the
<i>selection path</i>, into a set of element indices, the <i>selection
domain</i>. Each user command modifies the current selection path. The
first element of the a selection path is called the <i>anchor</i>, the last
the <i>active end</i>. 
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Code conventions</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Member variables and functions that start with an underscore are
intended to be private to the class they are defined in. Client code
should not refer to such members.
</p>
</div>
</div>
