org/multiselect_library.org
*** Maps and sets
    :PROPERTIES:
    :CUSTOM_ID: sec-maps-and-sets
    :END:

Selection mappings and selection domains are represented using
JavaScript's built-in ~Set~ and ~Map~ types. These are features that
are planned for EcmaScript 6 (known as "ES6 Harmony"), and supported
by modern browsers.  The benefit of using ~Set~ and ~Map~ over
JavaScript's built-in property maps is that ~Set~ and ~Map~ accept any
types as keys, whereas property maps' keys are strings.  Object
references as keys are convenient. For example, a ~Map~ from object
references to objects is a natural indexed family for a set of
DOM-elements; the order of the indices is their insertion order to the
map.

We use a few helper functions to deal with sets and maps.

#+NAME: set-and-map-functions
#+BEGIN_SRC js 
  function makeEmptySet() { return new Set(); }
  function makeEmptyMap() { return new Map(); }

  function isEmpty(collection) { return collection.size === 0; }
  function isSingleton(collection) { return collection.size === 1; }

  function firstKey(collection) {  
    // The body should be:
    //   return collection.keys().next().value; 
    // but Safari 8 does not support .next, therefore the workarounds below

    if (typeof collection.keys().next === 'function') {
      return collection.keys().next().value;
    } else {
      var it = collection.keys();
      for (var v of it) return v;
      return undefined;
    }
  }

  function copySet (s) { 
    var s2 = makeEmptySet();
    s.forEach(function (key) { s2.add(key); });
    return s2;
  }

  function copyMap (s) { 
    var s2 = makeEmptyMap();
    s.forEach(function (value, key) { s2.set(key, value); });
    return s2;
  }
#+END_SRC

The ~firstKey~ function returns the first key of a collection in
insertion order, or ~undefined~ if the collection is empty. The
~isEmpty~, ~isSingleton~, and ~firstKey~ functions work for both ~Set~
and ~Map~ types.

The ~equalKeys~ function implements set equality between two ~Set~ objects, 
and set equality of keys between two ~Map~ objects. 

#+NAME: equal-keys
#+BEGIN_SRC js
  function equalKeys(a, b) { 
    if (a.size !== b.size) return false;
    for (var i of a.keys()) if (!b.has(i)) return false;
    return true;
  }
#+END_SRC

The ~setUnion~ takes zero or more collections as argments, 
and returns the union of their keys as a ~Set~:

#+NAME: set-union
#+BEGIN_SRC js
  function setUnion () {
    var s = makeEmptySet();
    for (var i=0; i<arguments.length; ++i) {
       for (var j of arguments[i].keys()) s.add(j);
    }
    return s;
  }
#+END_SRC

The ~mapSymmetricDifference~ computes the symmetric difference of the
keys of the collections ~left~ and ~right~ as a ~Map~. The keys of the
result are the elements that belong to exactly one of ~left~ and
~right~. The values for keys that only belong to ~left~ are set to
~leftValue~, and those to ~right~ to ~rightValue~.

#+NAME: map-symmetric-difference
#+BEGIN_SRC js
  function mapSymmetricDifference (left, right, leftValue, rightValue) {
    var s = makeEmptyMap();
    for (var i of left.keys()) if (!right.has(i)) s.set(i, leftValue);
    for (var i of right.keys()) if (!left.has(i)) s.set(i, rightValue);
    return s; 
  }
#+END_SRC

*** Utilities scrap                                                :noexport:

The ~default_geometry.hs~ has the basic utility functions and
definitions needed to write the default geometry and perhaps
other geometries. It exports them, but then we also make them
directly defined within the ~multiselect.js~ module, because the utilities
are also used throughout the multiselect library.
Almost all of the utilities will be re-exported by the multiselect module.

#+NAME: include-default-geometry
#+BEGIN_SRC js :exports none :noweb yes
  <<default-geometry>>
  <<geometry-directions>>
  <<geometry-utilities>>
#+END_SRC

#+NAME: import-default-geometry
#+BEGIN_SRC js :exports none :noweb yes
  var dg = require("./default_geometry.js");

  var DefaultGeometry = dg.DefaultGeometry;
  var anchor = dg.anchor;
  var activeEnd = dg.activeEnd;

  var makeEmptyMap = dg.makeEmptyMap;
  var makeEmptySet = dg.makeEmptySet;

  var isEmpty = dg.isEmpty;
  var isSingleton = dg.isSingleton;
  var firstKey = dg.firstKey;
  var copySet = dg.copySet;
  var copyMap = dg.copyMap;

  var UP = dg.UP;
  var DOWN = dg.DOWN;
  var LEFT = dg.LEFT;
  var RIGHT = dg.RIGHT;
  var NO_DIRECTION = dg.NO_DIRECTION;
#+END_SRC

#+NAME: utilities
#+BEGIN_SRC js :exports none :noweb yes
  <<equal-keys>>
  <<set-union>>
  <<map-symmetric-difference>>
  <<modifier-keys>>
#+END_SRC

*** Utilities tests                                        :noexport:ARCHIVE:

#+NAME: utilities-tests
#+BEGIN_SRC js :exports none :noweb yes
  test("Utilities tests", function (t) {
    
    var s = makeEmptySet();
    var m = makeEmptyMap();

    t.ok(isEmpty(s), "isEmpty 1");
    t.ok(isEmpty(m), "isEmpty 2");

    t.ok(!isSingleton(s), "isSingleton 1");
    t.ok(!isSingleton(m), "isSingleton 2");

    t.equal(firstKey(s), undefined, "firstKey 1");
    t.equal(firstKey(m), undefined, "firstKey 2");

    t.ok(multiselect.detail.equalKeys(s, m), "equalKeys 1");

    // add 1st elem to both
    s.add(1); m.set(1, true);

    t.ok(isSingleton(s), "isSingleton 3");
    t.ok(isSingleton(m), "isSingleton 4");

    t.ok(!isEmpty(s));
    t.ok(!isEmpty(m));

    t.equal(firstKey(s), 1, "firstKey 3");
    t.equal(firstKey(m), 1, "firstKey 4");

    // add 2nd elem to both
    s.add(2); m.set(2, true);
    t.ok(!isSingleton(s)), "not singleton 1";
    t.ok(!isSingleton(m)), "not singleton 2";

    t.equal(firstKey(s), 1, "firstKey 5");
    t.equal(firstKey(m), 1, "firstKey 6");
        
    t.ok(multiselect.detail.equalKeys(s, m), "equalKeys 2");

    // add 3rd to s
    s.add(3);
    t.ok(!multiselect.detail.equalKeys(s, m), "not equalKeys");
  });
#+END_SRC
* Selection functions 
    :PROPERTIES:
    :CUSTOM_ID: sec-selection-functions
    :END:

Implementations of the four possible selection functions, of type
~bool~ $\to$ ~bool~, are as follows:

#+NAME: selection-functions
#+BEGIN_SRC js
  function tt(_)  { return true; };  tt.constant  = true;
  function ff(_)  { return false; }; ff.constant  = true;
  function id(b)  { return b; };     id.constant  = false;
  function not(b) { return !b; };    not.constant = false;
#+END_SRC

Only these functions (rather than arbitrary user-defined functions of
type ~bool~ $\to$ ~bool~) are used as selection functions of selection
operations. This is because some library functions need to (1) know
whether the function is constant and (2) compare functions for
equality. Both of these determinations can be done easily for
arbitrary functions of type ~bool~ $\to$ ~bool~ but determining
constness based on the ~constant~ flag and function equality via
object identity comparisons is even easier.

