dist-docs/library/multiselect_library.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Utility functions</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-maps-and-sets" class="outline-4">
<h4 id="sec-maps-and-sets"><a id="sec-1-3-1"></a><span class="section-number-4">1.3.1</span> Maps and sets</h4>
<div class="outline-text-4" id="text-sec-maps-and-sets">
<p>
Selection mappings and selection domains are represented using
JavaScript&rsquo;s built-in <code>Set</code> and <code>Map</code> types. These are features that
are planned for EcmaScript 6 (known as &ldquo;ES6 Harmony&rdquo;), and supported
by modern browsers.  The benefit of using <code>Set</code> and <code>Map</code> over
JavaScript&rsquo;s built-in property maps is that <code>Set</code> and <code>Map</code> accept any
types as keys, whereas property maps&rsquo; keys are strings.  Object
references as keys are convenient. For example, a <code>Map</code> from object
references to objects is a natural indexed family for a set of
DOM-elements; the order of the indices is their insertion order to the
map.
</p>

<p>
We use a few helper functions to deal with sets and maps:
</p>

<div class="org-src-container">

<pre class="src src-js" id="set-and-map-functions">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">makeEmptySet</span>() { <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Set</span>(); }
  <span style="color: #0000FF;">function</span> <span style="color: #006699;">makeEmptyMap</span>() { <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Map</span>(); }

  <span style="color: #0000FF;">function</span> <span style="color: #006699;">isEmpty</span>(<span style="color: #BA36A5;">collection</span>) { <span style="color: #0000FF;">return</span> collection.size === 0; }
  <span style="color: #0000FF;">function</span> <span style="color: #006699;">isSingleton</span>(<span style="color: #BA36A5;">collection</span>) { <span style="color: #0000FF;">return</span> collection.size === 1; }

  <span style="color: #0000FF;">function</span> <span style="color: #006699;">firstKey</span>(<span style="color: #BA36A5;">collection</span>) {
    <span style="color: #0000FF;">return</span> collection.keys().next().value; 
  }

  <span style="color: #0000FF;">function</span> <span style="color: #006699;">copySet</span> (<span style="color: #BA36A5;">s</span>) { 
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s2</span> = makeEmptySet();
    s.forEach(<span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">key</span>) { s2.add(key); });
    <span style="color: #0000FF;">return</span> s2;
  }

  <span style="color: #0000FF;">function</span> <span style="color: #006699;">copyMap</span> (<span style="color: #BA36A5;">s</span>) { 
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s2</span> = makeEmptyMap();
    s.forEach(<span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">value</span>, <span style="color: #BA36A5;">key</span>) { s2.set(key, value); });
    <span style="color: #0000FF;">return</span> s2;
  }
</pre>
</div>

<p>
The <code>firstKey</code> function returns the first key of a collection in
insertion order, or <code>undefined</code> if the collection is empty. The
<code>isEmpty</code>, <code>isSingleton</code>, and <code>firstKey</code> functions work for both <code>Set</code>
and <code>Map</code> types.
</p>

<p>
The <code>equalKeys</code> function implements set equality between two <code>Set</code> objects, 
and set equality of keys between two <code>Map</code> objects. 
</p>

<div class="org-src-container">

<pre class="src src-js" id="equal-keys">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">equalKeys</span>(<span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">b</span>) { 
    <span style="color: #0000FF;">if</span> (a.size !== b.size) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">false</span>;
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of a.keys()) <span style="color: #0000FF;">if</span> (!b.has(i)) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">false</span>;
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">true</span>;
  }
</pre>
</div>

<p>
The <code>setUnion</code> takes zero or more collections as argments, 
and returns the union of their keys as a <code>Set</code>:
</p>

<div class="org-src-container">

<pre class="src src-js" id="set-union">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">setUnion</span> () {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s</span> = makeEmptySet();
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span>=0; i&lt;<span style="color: #8b1a1a;">arguments</span>.length; ++i) {
       <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">j</span> of <span style="color: #8b1a1a;">arguments</span>[i].keys()) s.add(j);
    }
    <span style="color: #0000FF;">return</span> s;
  }
</pre>
</div>

<p>
The <code>mapSymmetricDifference</code> computes the symmetric difference of the
keys of the collections <code>left</code> and <code>right</code> as a <code>Map</code>. The keys of the
result are the elements that belong to exactly one of <code>left</code> and
<code>right</code>. The values for keys that only belong to <code>left</code> are set to
<code>leftValue</code>, and those to <code>right</code> to <code>rightValue</code>.
</p>

<div class="org-src-container">

<pre class="src src-js" id="map-symmetric-difference">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">mapSymmetricDifference</span> (<span style="color: #BA36A5;">left</span>, <span style="color: #BA36A5;">right</span>, <span style="color: #BA36A5;">leftValue</span>, <span style="color: #BA36A5;">rightValue</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s</span> = makeEmptyMap();
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of left.keys()) <span style="color: #0000FF;">if</span> (!right.has(i)) s.set(i, leftValue);
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of right.keys()) <span style="color: #0000FF;">if</span> (!left.has(i)) s.set(i, rightValue);
    <span style="color: #0000FF;">return</span> s; 
  }
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-selection-functions" class="outline-2">
<h2 id="sec-selection-functions"><a id="sec-2"></a><span class="section-number-2">2</span> Selection functions</h2>
<div class="outline-text-2" id="text-sec-selection-functions">
<p>
Implementations of the four possible selection functions, of type
<code>bool</code> \(\to\) <code>bool</code>, are as follows:
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-functions">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">tt</span>(<span style="color: #BA36A5;">_</span>)  { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">true</span>; };  tt.constant  = <span style="color: #8b1a1a;">true</span>;
  <span style="color: #0000FF;">function</span> <span style="color: #006699;">ff</span>(<span style="color: #BA36A5;">_</span>)  { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">false</span>; }; ff.constant  = <span style="color: #8b1a1a;">true</span>;
  <span style="color: #0000FF;">function</span> <span style="color: #006699;">id</span>(<span style="color: #BA36A5;">b</span>)  { <span style="color: #0000FF;">return</span> b; };     id.constant  = <span style="color: #8b1a1a;">false</span>;
  <span style="color: #0000FF;">function</span> <span style="color: #006699;">not</span>(<span style="color: #BA36A5;">b</span>) { <span style="color: #0000FF;">return</span> !b; };    not.constant = <span style="color: #8b1a1a;">false</span>;
</pre>
</div>

<p>
Only these functions (rather than arbitrary user-defined functions of
type <code>bool</code> \(\to\) <code>bool</code>) are used as selection functions of selection
operations. This is because some library functions need to (1) know
whether the function is constant and (2) compare functions for
equality. Both of these determinations can be done easily for
arbitrary functions of type <code>bool</code> \(\to\) <code>bool</code> but determining
constness based on the <code>constant</code> flag and function equality via
object identity comparisons is even easier.
</p>
</div>
</div>
