org/multiselect_library.org
* Selection mapping
  :PROPERTIES:
  :CUSTOM_ID: sec-selection-mapping
  :END:

The ~makeSelectionMapping()~ factory function creates a selection
mapping.  This function object[fn:1] realizes a function from indices,
the set $I$, to ~bool~.  The mapping is internally represented as a
~Set~ whose elements are exactly those indices that map to ~true~.

#+NAME: selection-mapping
#+BEGIN_SRC js
  function makeSelectionMapping () {

    var s = makeEmptySet();

    var func = function (i) { return s.has(i); };

    func.set = function (i, v) {
      if (v === true) s.add(i); else s.delete(i); 
    }

    func.selected = function() { return s.keys(); } 

    func.bake = function (op) {
      var s2 = op(func);
      op.domain.forEach(function(_, i) { func.set(i, s2(i)); });
    }

    return func;
  }
#+END_SRC

The selection mapping function object has three member functions:

- ~set(i, v)~
  
  Sets the element ~i~ to value ~v~. After ~s.set(i, v)~, ~s(i) ===
  true~ if ~v === true~, otherwise ~s(i) === false~.

- ~selected()~

  Returns an ~Iterator~ of the entries in the set (the selected
  elements).  The elements are iterated in insertion order, which is
  what JavaScript's ~Set~ provides.

- ~bake(op)~ 
  
  Updates the selection mapping to the result of applying the
  selection operation ~op~ to it. If ~op(s)~ realizes some mapping
  $m$, after ~s.bake(op)~, ~s~ realizes that mapping $m$.

[fn:1] By /function object/ we mean an object that can be called with
the function call syntax. It can be stateful and have both member
variables and member functions.

** Baking tests                                            :noexport:ARCHIVE:

#+NAME: baking-tests
#+BEGIN_SRC js :exports none :noweb yes
  test("Baking tests", function (t) {

    var M = multiselect;

    var D = M.detail;
    var s = D.makeSelectionMapping();
    var F = false, T = true;
    
    s.bake(D.makeOp(D.tt, dom())); // select no elements
    t.ok(arrayEquals([0, 1, 2, 3, 4].map(s),
                     [F, F, F, F, F]), "bake empty domain");
    
    s.bake(D.makeOp(D.tt, dom(1, 3))); // select 1 and 3
    t.ok(arrayEquals([0, 1, 2, 3, 4].map(s), 
                     [F, T, F, T, F]), "bake 1 and 3 true");
    
    s.bake(D.makeOp(D.ff, dom(1, 2))); // deselect 1 and 2
    t.ok(arrayEquals([0, 1, 2, 3, 4].map(s), 
                     [F, F, F, T, F]), "bake 1 and 2 false");
    
    s.bake(D.makeOp(D.not, dom(1, 3))); // flip 1 and 3
    t.ok(arrayEquals([0, 1, 2, 3, 4].map(s), 
                     [F, T, F, F, F]), "negate 1 and 3");
  });
#+END_SRC

* Selection operations

The ~makeOp(f, domain)~ factory function constructs a selection
operation.  Its parameters are:

  - ~f~ --- the selection function (one of ~tt~, ~ff~, ~id~, or ~not~,
    see Section [[#sec-selection-functions]]).
  - ~domain~ --- the selection domain. This value is expected to 
    be of type ~Map~, even though conceptually it is a set. The
    selection domain as a set is all the keys in that ~Map~ object, regardless
    of the value in that entry. Why selection domains are implemented as maps is explained
    in Section [[#sec-composition]].

Both arguments to ~makeOp~ are stored as members of the resulting (function) object,
as ~f~ and ~domain~.

#+NAME: primitive-selection-operation
#+BEGIN_SRC js 
  function makeOp (f, domain) {

    var func;
    if (f.constant) {
      func = function (s) {
        return function (i) {
          return (domain.has(i)) ? f() : s(i);
        }
      }
    } else {
      func = function (s) {
        return function (i) {
          return (domain.has(i)) ? f(s(i)) : s(i);
        }
      }
    }
    
    func.f = f;
    func.domain = domain;

    return func;
  }
#+END_SRC

The function call operator of the selection operator object takes one
of two of definitions, based on whether ~f~ is a constant function or
not;  if ~f~ is constant, there is no need to access the previous
state ~s(i)~ if ~i~ is within the operator's ~domain~.

** Primitive selection operation tests                     :noexport:ARCHIVE:

#+NAME: primitive-selection-operation-tests
#+BEGIN_SRC js :exports none
  test ("Primitive selection operation tests", function (t) {

    var M = multiselect;
    var D = M.detail;
    var F = false, T = true;
 
    var s = D.makeOp(D.tt, makeEmptyMap())(D.makeSelectionMapping());
    t.ok(arrayEquals([0, 1, 2, 3].map(s), 
                     [F, F, F, F]), "empty domain");

    s = D.makeOp(D.tt, dom(1, 3))(s);
    t.ok(arrayEquals([0, 1, 2, 3].map(s), 
                     [F, T, F, T]), "true function");

    s = D.makeOp(D.ff, dom(1, 3))(s);
    t.ok(arrayEquals([0, 1, 2, 3].map(s), 
                     [F, F, F, F]), "false function");

    s = D.makeOp(D.not, dom(1, 3))(s);
    t.ok(arrayEquals([0, 1, 2, 3].map(s), 
                     [F, T, F, T]), "negation function");

  });
#+END_SRC
