dist-docs/library/multiselect_library.html

<div id="outline-container-sec-selection-mapping" class="outline-2">
<h2 id="sec-selection-mapping"><a id="sec-3"></a><span class="section-number-2">3</span> Selection mapping</h2>
<div class="outline-text-2" id="text-sec-selection-mapping">
<p>
The <code>makeSelectionMapping()</code> factory function creates a selection
mapping.  This function object<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> realizes a function from indices,
the set \(I\), to <code>bool</code>.  The mapping is internally represented as a
<code>Set</code> whose elements are exactly those indices that map to <code>true</code>.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-mapping">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">makeSelectionMapping</span> () {

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s</span> = makeEmptySet();

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">func</span> = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">i</span>) { <span style="color: #0000FF;">return</span> s.has(i); };

    func.set = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">i</span>, <span style="color: #BA36A5;">v</span>) {
      <span style="color: #0000FF;">if</span> (v === <span style="color: #8b1a1a;">true</span>) s.add(i); <span style="color: #0000FF;">else</span> s.<span style="color: #0000FF;">delete</span>(i); 
    }

    func.selected = <span style="color: #0000FF;">function</span>() { <span style="color: #0000FF;">return</span> s.keys(); } 

    func.bake = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">op</span>) {
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">s2</span> = op(func);
      op.domain.forEach(<span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">i</span>) { func.set(i, s2(i)); });
    }

    <span style="color: #0000FF;">return</span> func;
  }
</pre>
</div>

<p>
The selection mapping function object has three member functions:
</p>

<ul class="org-ul">
<li><p>
<code>set(i, v)</code>
</p>

<p>
Sets the element <code>i</code> to value <code>v</code>. After <code>s.set(i, v)</code>, <code>s(i) ===
  true</code> if <code>v === true</code>, otherwise <code>s(i) === false</code>.
</p></li>

<li><p>
<code>selected()</code>
</p>

<p>
Returns an <code>Iterator</code> of the entries in the set (the selected
elements).  The elements are iterated in insertion order, which is
what JavaScript&rsquo;s <code>Set</code> provides.
</p></li>

<li><p>
<code>bake(op)</code> 
</p>

<p>
Updates the selection mapping to the result of applying the
selection operation <code>op</code> to it. If <code>op(s)</code> realizes some mapping
\(m\), after <code>s.bake(op)</code>, <code>s</code> realizes that mapping \(m\).
</p></li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Selection operations</h2>
<div class="outline-text-2" id="text-4">
<p>
The <code>makeOp(f, domain)</code> factory function constructs a selection
operation.  Its parameters are:
</p>

<ul class="org-ul">
<li><code>f</code> &#x2014; the selection function (one of <code>tt</code>, <code>ff</code>, <code>id</code>, or <code>not</code>,
see Section <a href="#sec-selection-functions">2</a>).</li>
<li><code>domain</code> &#x2014; the selection domain. This value is expected to 
be of type <code>Map</code>, even though conceptually it is a set. The
selection domain as a set is all the keys in that <code>Map</code> object, regardless
of the value in that entry. Why selection domains are implemented as maps is explained
in Section <a href="#sec-composition">5</a>.</li>
</ul>

<p>
Both arguments to <code>makeOp</code> are stored as members of the resulting (function) object,
as <code>f</code> and <code>domain</code>.
</p>

<div class="org-src-container">

<pre class="src src-js" id="primitive-selection-operation">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">makeOp</span> (<span style="color: #BA36A5;">f</span>, <span style="color: #BA36A5;">domain</span>) {

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">func</span>;
    <span style="color: #0000FF;">if</span> (f.constant) {
      func = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">s</span>) {
        <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">i</span>) {
          <span style="color: #0000FF;">return</span> (domain.has(i)) ? f() : s(i);
        }
      }
    } <span style="color: #0000FF;">else</span> {
      func = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">s</span>) {
        <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">i</span>) {
          <span style="color: #0000FF;">return</span> (domain.has(i)) ? f(s(i)) : s(i);
        }
      }
    }
    
    func.f = f;
    func.domain = domain;

    <span style="color: #0000FF;">return</span> func;
  }
</pre>
</div>

<p>
The function call operator of the selection operator object takes one
of two of definitions, based on whether <code>f</code> is a constant function or
not;  if <code>f</code> is constant, there is no need to access the previous
state <code>s(i)</code> if <code>i</code> is within the operator&rsquo;s <code>domain</code>.
</p>
</div>
</div>
