org/multiselect_library.org
* Composition of selection operations
  :PROPERTIES:
  :CUSTOM_ID: sec-composition
  :END:


The function ~makeOpComposition~ creates a composition of 
selection operations.  This function object is a selection operation
itself, so applying it to a selection mapping produces a selection
mapping. In symbols, if ~c~ is a composition and ~s~ a selection
mapping, ~c(s)~ is also a selection mapping.

#+NAME: op-composition
#+BEGIN_SRC js :noweb no-export
    function makeOpComposition () {

      var ops = [];                
      var domain = makeEmptyMap(); 
      var gen = 0;                                                    

      var func = function (s) {
        <<op-composition-function-call-operator-body>>
      }
     
      func.domain = domain;
      
      // member functions of func
      <<op-composition-push>>
      <<op-composition-pop>>
      <<op-composition-top>>
      <<op-composition-top2>>
      <<op-composition-shift>>
      <<op-composition-size>>
      <<op-composition-remove-index>>
      
      return func;
    }
#+END_SRC

The composed selection operations are stored in the ~ops~
array.  The keys of the ~domain~ map are the union of the domains
of all selection operations in ~ops~. The counter ~gen~
grows with each added selection operation. 

Assume the composition object represents the value $f \circ g \circ h$.
Then ~ops~ is the array ~[h, g, f]~.  The selection status of an element $i$ in $(f \circ g
\circ h)(s)$, where $s$ is the base selection mapping, could simply be
determined by computing ~f(g(h(s)))(i)~. Often the result, however,
does not depend on all functions in the composition. For example, if
~f~'s selection function is constant and ~i~ belongs to ~f~'s domain,
then ~f(g(h(s)))(i)~ is equal to ~f(s)(i)~. Or if ~i~ is not in ~f~'s
or ~g~'s domain, then ~f(g(h(s)))(i)~ is equal to ~h(s)(i)~.  The
composition object maintains extra information to avoid unnecessary
evaluations. 

The basic scheme is that ~domain~ maps each index ~i~ to the first
selection operation whose domain includes ~i~, and the
domain of that selection operation maps ~i~ to the next
selection operation whose domain includes ~i~, and so
forth. In more details:

- If for some composition object ~domain.has(i)~ is true,
  then ~ops[ops.length-1 - (gen - domain.get(i))]~ is the first
  (counting backwards from the end of the array) selection
  operation that defines a value for index ~i~.  If ~domain.has(i)~ is
  false, then ~i~ does not belong to the domain of any of the
  selection operators in ~ops~.  

- The value of ~gen~ is increased with every addition of a 
  selection operation to the composition. The purpose of ~gen~
  is to avoid updating every element of ~domain~ when new operations
  are added to ~ops~.
 
- Assume ~ops[n]~ is the first selection operation that
  defines ~i~.  If ~op~'s selection function ~f~ is not constant (it
  is ~id~ or ~not~), then to obtain the selection status of ~i~, ~i~'s
  prior status is needed. This prior status is determined by the
  closest selection operation that has ~i~ in its domain,
  which is found as follows.
  The expression ~ops[n].domain.get(i)~ has
  some integral value ~k~. The meaning of ~k~ is the distance in the
  ~ops~ array to the closest entry that defines the selection status
  of ~i~. In other words, ~ops[n-k].domain.has(i)~ is ~true~, and for
  all ~0 < j < k~, ~ops[n-j].domain.has(i)~ is ~false~.  If ~k > n~,
  ~i~ belongs to the domain of no prior primitive selection operation;
  ~i~'s selection state is then ~s(i)~, determined only by the base
  selection mapping ~s~.

#  Note that when the selection function is constant (~tt~ or ~ff~),
#  the ~ops~ composition need not be traversed further.  If no ~id~ or
#  ~not~ selection functions are used anywhere in the composition, no
#  more than one selection function is evaluated to determine the
#  selection status of an element.

The implementation of ~func~'s function call operator takes advantage
of the avove encodings. First, if an element ~i~ is not in the
selection domain of some selection operation, the selection
function of that operation is never evaluated when determining the
selection status of ~i~. Second, if an element ~i~ is in the 
domain of a selection operation whose selection function is
constant, and that function is evaluated to find out the
selection status of ~i~, then no further selection functions are
invoked.

#+CAPTION: ~<<op-composition-function-call-operator-body>>~
#+NAME: op-composition-function-call-operator-body
#+BEGIN_SRC js :noweb strip-export
  return function (i) {
    return evaluate(domain.has(i) ? (ops.length-1) - (gen-domain.get(i)) : -1, i)(i);
  }

  // determine selection state of i but only access the elements 
  // of ops (staring from ind) that have i in their domain
  function evaluate(ind, i) {
    if (ind < 0) return s; // i defined in the base selection mapping s
    else {
      var op = ops[ind];
      return op(function (j) { return evaluate(ind - op.domain.get(i), j)(i); });
      // the call to evaluate is wrapped to a lambda to make the call lazy.
      // op will only call the lambda if op.f.constant is false
    }
  }
#+END_SRC

The public methods of a composition object are:

  - ~push(op)~ 

    - Adds ~op~ to the composition; if ~c~ represents the 
      composition $r_1 \circ r_2 \circ \cdots \circ r_n$, 
      then ~c.push(op)~ represents the
      composition ~op~ $\circ\, r_1 \circ r_2 \circ \cdots \circ r_n$.

      #+CAPTION: ~<<op-composition-push>>~
      #+NAME: op-composition-push
      #+BEGIN_SRC js :noweb strip-export
        func.push = function (op) {
          ops.push(op);
          ++gen
          op.domain.forEach(function(_, i) {
            op.domain.set(i, domain.has(i) ? gen - domain.get(i) : ops.length);
            domain.set(i, gen); 
          });
        }
      #+END_SRC

    - When ~op~ is pushed to ~ops~, each element ~i~ in its domain is
      assigned the distance to the previous operation in ~ops~ that
      defines ~i~. If none defines ~i~, the distance is the length of
      ~ops~, indicating that the previous definition is the base
      selection mapping. The composition's domain is also updated for
      each ~i~, setting the newly added operation ~op~ as the most
      recent one that defines the selection state of ~i~.
      
  - ~pop()~

    - Removes the most recently pushed operation from the composition.
      If ~c~ is $r_1 \circ r_2 \circ \cdots \circ r_n$, then
      ~c.pop()~ is $r_2 \circ \cdots \circ r_n$. 

      /Precondition:/ ~ops~ not empty.

      #+CAPTION: ~<<op-composition-pop>>~
      #+NAME: op-composition-pop
      #+BEGIN_SRC js :noweb strip-export
        func.pop = function () {
          var n = ops.length;
          var op = ops.pop();
          --gen;
          // domain updated for those elements that are in op.domain
          op.domain.forEach(function (_, i) {
            if (op.domain.get(i) >= n) domain.delete(i); // no op defines i
            else domain.set(i, domain.get(i) - op.domain.get(i)); 
          });
          return op;
        }
      #+END_SRC
    
  - ~top()~
  
    - Returns a reference to the most recently pushed operation.

      /Precondition:/ ~ops~ not empty.

      #+CAPTION: ~<<op-composition-top>>~
      #+NAME: op-composition-top
      #+BEGIN_SRC js :noweb strip-export
        func.top = function () { return ops[ops.length - 1]; }
      #+END_SRC

  - ~top2()~
  
    - Returns a reference to the second-most recently pushed operation.

      /Precondition:/ ~ops~ has at least two elements.

      #+CAPTION: ~<<op-composition-top2>>~
      #+NAME: op-composition-top2
      #+BEGIN_SRC js :noweb strip-export
        func.top2 = function () { return ops[ops.length - 2]; }
      #+END_SRC

  - ~shift()~

    - Removes the least recently pushed operation from the composition.
      If ~c~ is $r_1 \circ r_2 \cdots \circ r_n$, then
      ~c.shift()~ is $r_1 \circ r_2 \cdots \circ r_{n-1}$. Returns
      the removed operation.

      /Precondition:/ ~ops~ not empty.

      #+CAPTION: ~<<op-composition-shift>>~
      #+NAME: op-composition-shift
      #+BEGIN_SRC js :noweb strip-export
        func.shift = function (bmap) {
          var op = ops.shift();
          op.domain.forEach(function(_, i) {
            if (domain.get(i) - gen === ops.length) { domain.delete(i); }
            // if lastOp the only op that defines i, remove i from domain
          });
          return op;
        }
     #+END_SRC

  - ~size()~
 
    - Returns the number of operations in ~ops~.

      #+CAPTION: ~<<op-composition-size>>~
      #+NAME: op-composition-size
      #+BEGIN_SRC js :noweb strip-export 
        func.size = function () { return ops.length; }
      #+END_SRC

  - ~removeIndex(i)~

    - Removes an index from ~domain~ and all domains in ~ops~.

      #+CAPTION: ~<<op-composition-remove-index>>~
      #+NAME: op-composition-remove-index
      #+BEGIN_SRC js :noweb strip-export 
        func.removeIndex = function (i) {
          if (!domain.has(i)) return;

          // find the first op in ops that defines i
          var j = (ops.length - 1) - (gen - domain.get(i));

          while (j >= 0) {
            var d = ops[j].domain.get(i);
            ops[j].domain.delete(i);
            j -= d;
          }
          domain.delete(i);
        }
      #+END_SRC

