dist-docs/library/multiselect_library.html

<div id="outline-container-sec-composition" class="outline-2">
<h2 id="sec-composition"><a id="sec-5"></a><span class="section-number-2">5</span> Composition of selection operations</h2>
<div class="outline-text-2" id="text-sec-composition">
<p>
The function <code>makeOpComposition</code> creates a composition of 
selection operations.  This function object is a selection operation
itself, so applying it to a selection mapping produces a selection
mapping. In symbols, if <code>c</code> is a composition and <code>s</code> a selection
mapping, <code>c(s)</code> is also a selection mapping.
</p>

<div class="org-src-container">

<pre class="src src-js" id="op-composition">    <span style="color: #0000FF;">function</span> <span style="color: #006699;">makeOpComposition</span> () {

      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">ops</span> = [];                
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">domain</span> = makeEmptyMap(); 
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">gen</span> = 0;                                                    

      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">func</span> = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">s</span>) {
        &lt;&lt;op-composition-<span style="color: #0000FF;">function</span>-call-operator-body&gt;&gt;
      }
     
      func.domain = domain;
      
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">member functions of func</span>
      &lt;&lt;op-composition-push&gt;&gt;
      &lt;&lt;op-composition-pop&gt;&gt;
      &lt;&lt;op-composition-top&gt;&gt;
      &lt;&lt;op-composition-top2&gt;&gt;
      &lt;&lt;op-composition-shift&gt;&gt;
      &lt;&lt;op-composition-size&gt;&gt;
      &lt;&lt;op-composition-remove-index&gt;&gt;
      
      <span style="color: #0000FF;">return</span> func;
    }
</pre>
</div>

<p>
The composed selection operations are stored in the <code>ops</code>
array.  The keys of the <code>domain</code> map are the union of the domains
of all selection operations in <code>ops</code>. The counter <code>gen</code>
grows with each added selection operation. 
</p>

<p>
Assume the composition object represents the value \(f \circ g \circ h\).
Then <code>ops</code> is the array <code>[h, g, f]</code>.  The selection status of an element \(i\) in \((f \circ g
\circ h)(s)\), where \(s\) is the base selection mapping, could simply be
determined by computing <code>f(g(h(s)))(i)</code>. Often the result, however,
does not depend on all functions in the composition. For example, if
<code>f</code>&rsquo;s selection function is constant and <code>i</code> belongs to <code>f</code>&rsquo;s domain,
then <code>f(g(h(s)))(i)</code> is equal to <code>f(s)(i)</code>. Or if <code>i</code> is not in <code>f</code>&rsquo;s
or <code>g</code>&rsquo;s domain, then <code>f(g(h(s)))(i)</code> is equal to <code>h(s)(i)</code>.  The
composition object maintains extra information to avoid unnecessary
evaluations. 
</p>

<p>
The basic scheme is that <code>domain</code> maps each index <code>i</code> to the first
selection operation whose domain includes <code>i</code>, and the
domain of that selection operation maps <code>i</code> to the next
selection operation whose domain includes <code>i</code>, and so
forth. In more details:
</p>

<ul class="org-ul">
<li>If for some composition object <code>domain.has(i)</code> is true,
then <code>ops[ops.length-1 - (gen - domain.get(i))]</code> is the first
(counting backwards from the end of the array) selection
operation that defines a value for index <code>i</code>.  If <code>domain.has(i)</code> is
false, then <code>i</code> does not belong to the domain of any of the
selection operators in <code>ops</code>.</li>

<li>The value of <code>gen</code> is increased with every addition of a 
selection operation to the composition. The purpose of <code>gen</code>
is to avoid updating every element of <code>domain</code> when new operations
are added to <code>ops</code>.</li>

<li>Assume <code>ops[n]</code> is the first selection operation that
defines <code>i</code>.  If <code>op</code>&rsquo;s selection function <code>f</code> is not constant (it
is <code>id</code> or <code>not</code>), then to obtain the selection status of <code>i</code>, <code>i</code>&rsquo;s
prior status is needed. This prior status is determined by the
closest selection operation that has <code>i</code> in its domain,
which is found as follows.
The expression <code>ops[n].domain.get(i)</code> has
some integral value <code>k</code>. The meaning of <code>k</code> is the distance in the
<code>ops</code> array to the closest entry that defines the selection status
of <code>i</code>. In other words, <code>ops[n-k].domain.has(i)</code> is <code>true</code>, and for
all <code>0 &lt; j &lt; k</code>, <code>ops[n-j].domain.has(i)</code> is <code>false</code>.  If <code>k &gt; n</code>,
<code>i</code> belongs to the domain of no prior primitive selection operation;
<code>i</code>&rsquo;s selection state is then <code>s(i)</code>, determined only by the base
selection mapping <code>s</code>.</li>
</ul>

<p>
The implementation of <code>func</code>&rsquo;s function call operator takes advantage
of the avove encodings. First, if an element <code>i</code> is not in the
selection domain of some selection operation, the selection
function of that operation is never evaluated when determining the
selection status of <code>i</code>. Second, if an element <code>i</code> is in the 
domain of a selection operation whose selection function is
constant, and that function is evaluated to find out the
selection status of <code>i</code>, then no further selection functions are
invoked.
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-function-call-operator-body&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-function-call-operator-body">  <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">i</span>) {
    <span style="color: #0000FF;">return</span> evaluate(domain.has(i) ? (ops.length-1) - (gen-domain.get(i)) : -1, i)(i);
  }

  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">determine selection state of i but only access the elements </span>
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">of ops (staring from ind) that have i in their domain</span>
  <span style="color: #0000FF;">function</span> <span style="color: #006699;">evaluate</span>(<span style="color: #BA36A5;">ind</span>, <span style="color: #BA36A5;">i</span>) {
    <span style="color: #0000FF;">if</span> (ind &lt; 0) <span style="color: #0000FF;">return</span> s; <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">i defined in the base selection mapping s</span>
    <span style="color: #0000FF;">else</span> {
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op</span> = ops[ind];
      <span style="color: #0000FF;">return</span> op(<span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">j</span>) { <span style="color: #0000FF;">return</span> evaluate(ind - op.domain.get(i), j)(i); });
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">the call to evaluate is wrapped to a lambda to make the call lazy.</span>
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">op will only call the lambda if op.f.constant is false</span>
    }
  }
</pre>
</div>

<p>
The public methods of a composition object are:
</p>

<ul class="org-ul">
<li><code>push(op)</code> 

<ul class="org-ul">
<li><p>
Adds <code>op</code> to the composition; if <code>c</code> represents the 
composition \(r_1 \circ r_2 \circ \cdots \circ r_n\), 
then <code>c.push(op)</code> represents the
composition <code>op</code> \(\circ\, r_1 \circ r_2 \circ \cdots \circ r_n\).
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-push&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-push">  func.push = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">op</span>) {
    ops.push(op);
    ++gen
    op.domain.forEach(<span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">i</span>) {
      op.domain.set(i, domain.has(i) ? gen - domain.get(i) : ops.length);
      domain.set(i, gen); 
    });
  }
</pre>
</div></li>

<li>When <code>op</code> is pushed to <code>ops</code>, each element <code>i</code> in its domain is
assigned the distance to the previous operation in <code>ops</code> that
defines <code>i</code>. If none defines <code>i</code>, the distance is the length of
<code>ops</code>, indicating that the previous definition is the base
selection mapping. The composition&rsquo;s domain is also updated for
each <code>i</code>, setting the newly added operation <code>op</code> as the most
recent one that defines the selection state of <code>i</code>.</li>
</ul></li>

<li><code>pop()</code>

<ul class="org-ul">
<li><p>
Removes the most recently pushed operation from the composition.
If <code>c</code> is \(r_1 \circ r_2 \circ \cdots \circ r_n\), then
<code>c.pop()</code> is \(r_2 \circ \cdots \circ r_n\). 
</p>

<p>
<i>Precondition:</i> <code>ops</code> not empty.
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-pop&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-pop">  func.pop = <span style="color: #0000FF;">function</span> () {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">n</span> = ops.length;
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op</span> = ops.pop();
    --gen;
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">domain updated for those elements that are in op.domain</span>
    op.domain.forEach(<span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">i</span>) {
      <span style="color: #0000FF;">if</span> (op.domain.get(i) &gt;= n) domain.<span style="color: #0000FF;">delete</span>(i); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">no op defines i</span>
      <span style="color: #0000FF;">else</span> domain.set(i, domain.get(i) - op.domain.get(i)); 
    });
    <span style="color: #0000FF;">return</span> op;
  }
</pre>
</div></li>
</ul></li>

<li><code>top()</code>

<ul class="org-ul">
<li><p>
Returns a reference to the most recently pushed operation.
</p>

<p>
<i>Precondition:</i> <code>ops</code> not empty.
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-top&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-top">  func.top = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> ops[ops.length - 1]; }
</pre>
</div></li>
</ul></li>

<li><code>top2()</code>

<ul class="org-ul">
<li><p>
Returns a reference to the second-most recently pushed operation.
</p>

<p>
<i>Precondition:</i> <code>ops</code> has at least two elements.
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-top2&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-top2">  func.top2 = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> ops[ops.length - 2]; }
</pre>
</div></li>
</ul></li>

<li><code>shift()</code>

<ul class="org-ul">
<li><p>
Removes the least recently pushed operation from the composition.
If <code>c</code> is \(r_1 \circ r_2 \cdots \circ r_n\), then
<code>c.shift()</code> is \(r_1 \circ r_2 \cdots \circ r_{n-1}\). Returns
the removed operation.
</p>

<p>
<i>Precondition:</i> <code>ops</code> not empty.
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-shift&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-shift">  func.shift = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">bmap</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op</span> = ops.shift();
    op.domain.forEach(<span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">_</span>, <span style="color: #BA36A5;">i</span>) {
      <span style="color: #0000FF;">if</span> (domain.get(i) - gen === ops.length) { domain.<span style="color: #0000FF;">delete</span>(i); }
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">if lastOp the only op that defines i, remove i from domain</span>
    });
    <span style="color: #0000FF;">return</span> op;
  }
</pre>
</div></li>
</ul></li>

<li><code>size()</code>

<ul class="org-ul">
<li><p>
Returns the number of operations in <code>ops</code>.
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-size&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-size">  func.size = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> ops.length; }
</pre>
</div></li>
</ul></li>

<li><code>removeIndex(i)</code>

<ul class="org-ul">
<li><p>
Removes an index from <code>domain</code> and all domains in <code>ops</code>.
</p>

<div class="org-src-container">
<label class="org-src-name"><code>&lt;&lt;op-composition-remove-index&gt;&gt;</code></label>
<pre class="src src-js" id="op-composition-remove-index">  func.removeIndex = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">i</span>) {
    <span style="color: #0000FF;">if</span> (!domain.has(i)) <span style="color: #0000FF;">return</span>;

    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">find the first op in ops that defines i</span>
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">j</span> = (ops.length - 1) - (gen - domain.get(i));

    <span style="color: #0000FF;">while</span> (j &gt;= 0) {
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">d</span> = ops[j].domain.get(i);
      ops[j].domain.<span style="color: #0000FF;">delete</span>(i);
      j -= d;
    }
    domain.<span style="color: #0000FF;">delete</span>(i);
  }
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
