org/multiselect_library.org
** Op composition tests                                    :noexport:ARCHIVE:

#+NAME: op-composition-tests
#+BEGIN_SRC js :exports none
  test ("Op composition tests", function (t) {

    var D = multiselect.detail;
    var s = D.makeSelectionMapping();
    var comp = D.makeOpComposition();
    var F = false, T = true;
    var sel = comp(s); 

    t.ok(arrayEquals([0, 1, 2].map(sel), [F, F, F]), "empty");
   
    comp.push(D.makeOp(D.tt, dom(1)));
    t.ok(arrayEquals([0, 1, 2].map(sel), [F, T, F]), "add 1");

    comp.push(D.makeOp(D.not, dom(0, 1, 2)));
    t.ok(arrayEquals([0, 1, 2].map(sel), [T, F, T]), "add 2");

    comp.push(D.makeOp(D.ff, dom(0, 1)));
    t.ok(arrayEquals([0, 1, 2].map(sel), [F, F, T]), "add 3");

    comp.pop();
    t.ok(arrayEquals([0, 1, 2].map(sel), [T, F, T]), "pop 1");

    comp.pop();
    t.ok(arrayEquals([0, 1, 2].map(sel), [F, T, F]), "pop 2");

    comp.pop();
    t.ok(arrayEquals([0, 1, 2].map(sel), [F, F, F]), "empty");

    // push three ops
    comp.push(D.makeOp(D.not, dom(0, 2)));
    comp.push(D.makeOp(D.tt,  dom(1, 2)));
    comp.push(D.makeOp(D.not, dom(0, 1)));
    t.ok(arrayEquals([0, 1, 2].map(sel), [F, F, T]), "add 3 again");

    comp.shift(); 
    t.ok(arrayEquals([0, 1, 2].map(sel), [T, F, T]), "shift 1");

    comp.shift(); 
    t.ok(arrayEquals([0, 1, 2].map(sel), [T, T, F]), "shift 2");

    comp.shift(); 
    t.ok(arrayEquals([0, 1, 2].map(sel), [F, F, F]), "shift 3");
   
  });
#+END_SRC

#+NAME: op-remove-index-tests
#+BEGIN_SRC js :exports none
  test ("Op composition removeIndex tests", function (t) {

    var D = multiselect.detail;
    var comp = D.makeOpComposition();
    var s = D.makeSelectionMapping();
    var selection = comp(s); 

    comp.push(D.makeOp(D.tt, dom(0)));
    comp.push(D.makeOp(D.tt, dom(1)));
    comp.push(D.makeOp(D.ff, dom(0)));
    comp.push(D.makeOp(D.tt, dom(0, 1)));
    t.ok(arrayEquals([0, 1].map(selection), [true, true]), "removeIndex 1");
    comp.removeIndex(1);
    t.ok(arrayEquals([0, 1].map(selection), [true, false]), "removeIndex 2");
    comp.removeIndex(0);
    t.ok(arrayEquals([0, 1].map(selection), [false, false]), "removeIndex 3");
  });
#+END_SRC

* Selection state

The ~SelectionState~ class stores all state of a multi-selection, 
that is, the information contained in the "selection state tuple"
described in the manuscript.  ~SelectionState~ is (most of) the public
API of {{{msjs}}}.  Its constructor's parameters are:

 - a /selection geometry/ (see Section [[#sec-selection-geometries]]),
 - a callback (~refresh~) that defines how to display the selection
   state (the default is a function that does nothing),
 - a flag that controls whether /change tracking/ should be used or
   not (the default is ~false~: no tracking), and
 - the maximum number of undo operations (the default is 10).

#+NAME: selection-state
#+BEGIN_SRC js 
  function SelectionState (geometry, refresh, tracking, maxUndo) {

    if (refresh === undefined) refresh = function () {};
    if (tracking === undefined) tracking = false;
    if (maxUndo === undefined) maxUndo = 10;

    this._geometry = geometry;
    this._tracking = tracking;
    this._refresh = refresh;
    this._maxOps = Math.max(2, 2 * maxUndo);
    this.reset();
  }
#+END_SRC

If ~tracking~ is ~true~, ~refresh~ will be called with a ~Map~ whose
keys are the indices of the changed elements, and values their current
selection status (~true~ or ~false~).  If ~tracking~ is false,
~refresh~ will be called with the current selection mapping.  Tracking
can simplify visualizing the selection, but it requires additional
computation and memory, so it is left optional.

The maximum number of selection operations, ~_maxOps~, is
twice ~maxUndo~, as each undoable operation consists of two 
selection operations.  At least one pair of selection
operations must be allowed, otherwise shift-click will not work as
expected (if each operation is immediately baked into the permanent
selection mapping, shift-click would not remember the prior state of
the elements under the current selection domain).

The rest of the initialization code is in the ~reset~ method.  This
method can be used if the entire selection state must be reset (e.g.,
to respond to the indexed family $I$ being changed).

#+NAME: selection-state-reset
#+BEGIN_SRC js 
  SelectionState.prototype.reset = function () {

    this._s = makeSelectionMapping();
    this._ops = makeOpComposition();
    this._spath = [];
    this._cursor = undefined;

    this._redoStack = [];
    this._current = this._ops(this._s); // current selection
    
    this._opsStatus = ACTIVE_NONE;        
    this._queuedCommand = function () {};
  };

  const ACTIVE_NONE = 0, ACTIVE_FILTER = 1, ACTIVE_SHIFT_CLICK_OR_SET_PATH = 2;
  const C_SHIFT_CLICK = 0, C_SET_PATH = 1;
#+END_SRC

The elements of the /selection state tuple/ described 
in the manuscript are represented by ~SelectionState~'s member
variables:

  1. ~_s~ is the selection mapping,
  2. ~_ops~ is the composition of primitive selection operations (it
     is an invariant that ~_ops~ always has an even number of
     selection operations),
  3. ~_spath~ is the selection path, 
  4. ~_cursor~ is the keyboard cursor, and
  5. ~_opsStatus~ is an indicator of whether the topmost selection
     operation is /active/ (open for modification) and for which command. It can
     take values ~ACTIVE_NONE~, ~ACTIVE_SHIFT_CLICK_OR_SET_PAHT~, or ~ACTIVE_FILTER~.
     If the status is ~ACTIVE_NONE~, then both shift-click/set path and filter
     methods will first add a new empty pair of selection operators to
     ~_ops~.  If it is ~ACTIVE_SHIFT_CLICK~, then shift-click or set path will not
     add a new pair, but filter will. The roles are reversed with
     ~ACTIVE_FILTER~.


The ~_redoStack~ variable contains the redoable commands (selection
operations).  The ~_current~ variable is bound to the value
~_ops(_s)~, and it is thus the selection mapping that reflects the
current selection status of the elements. Finally, ~_queuedCommand~ is
a one-element command queue, which is used in combining several
consecutive shift-click operations, or several consequtive set path
operations, to one.

