dist-docs/library/multiselect_library.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Selection state</h2>
<div class="outline-text-2" id="text-6">
<p>
The <code>SelectionState</code> class stores all state of a multi-selection, 
that is, the information contained in the &ldquo;selection state tuple&rdquo;
described in the manuscript.  <code>SelectionState</code> is (most of) the public
API of MultiselectJS.  Its constructor&rsquo;s parameters are:
</p>

<ul class="org-ul">
<li>a <i>selection geometry</i> (see Section <a href="#sec-selection-geometries">7</a>),</li>
<li>a callback (<code>refresh</code>) that defines how to display the selection
state (the default is a function that does nothing),</li>
<li>a flag that controls whether <i>change tracking</i> should be used or
not (the default is <code>false</code>: no tracking), and</li>
<li>the maximum number of undo operations (the default is 10).</li>
</ul>

<div class="org-src-container">

<pre class="src src-js" id="selection-state">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">SelectionState</span> (<span style="color: #BA36A5;">geometry</span>, <span style="color: #BA36A5;">refresh</span>, <span style="color: #BA36A5;">tracking</span>, <span style="color: #BA36A5;">maxUndo</span>) {

    <span style="color: #0000FF;">if</span> (refresh === <span style="color: #8b1a1a;">undefined</span>) refresh = <span style="color: #0000FF;">function</span> () {};
    <span style="color: #0000FF;">if</span> (tracking === <span style="color: #8b1a1a;">undefined</span>) tracking = <span style="color: #8b1a1a;">false</span>;
    <span style="color: #0000FF;">if</span> (maxUndo === <span style="color: #8b1a1a;">undefined</span>) maxUndo = 10;

    <span style="color: #8b1a1a;">this</span>._geometry = geometry;
    <span style="color: #8b1a1a;">this</span>._tracking = tracking;
    <span style="color: #8b1a1a;">this</span>._refresh = refresh;
    <span style="color: #8b1a1a;">this</span>._maxOps = Math.max(2, 2 * maxUndo);
    <span style="color: #8b1a1a;">this</span>.reset();
  }
</pre>
</div>

<p>
If <code>tracking</code> is <code>true</code>, <code>refresh</code> will be called with a <code>Map</code> whose
keys are the indices of the changed elements, and values their current
selection status (<code>true</code> or <code>false</code>).  If <code>tracking</code> is false,
<code>refresh</code> will be called with the current selection mapping.  Tracking
can simplify visualizing the selection, but it requires additional
computation and memory, so it is left optional.
</p>

<p>
The maximum number of selection operations, <code>_maxOps</code>, is
twice <code>maxUndo</code>, as each undoable operation consists of two 
selection operations.  At least one pair of selection
operations must be allowed, otherwise shift-click will not work as
expected (if each operation is immediately baked into the permanent
selection mapping, shift-click would not remember the prior state of
the elements under the current selection domain).
</p>

<p>
The rest of the initialization code is in the <code>reset</code> method.  This
method can be used if the entire selection state must be reset (e.g.,
to respond to the indexed family \(I\) being changed).
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-reset">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.reset = <span style="color: #0000FF;">function</span> () {

    <span style="color: #8b1a1a;">this</span>._s = makeSelectionMapping();
    <span style="color: #8b1a1a;">this</span>._ops = makeOpComposition();
    <span style="color: #8b1a1a;">this</span>._spath = [];
    <span style="color: #8b1a1a;">this</span>._cursor = <span style="color: #8b1a1a;">undefined</span>;

    <span style="color: #8b1a1a;">this</span>._redoStack = [];
    <span style="color: #8b1a1a;">this</span>._current = <span style="color: #8b1a1a;">this</span>._ops(<span style="color: #8b1a1a;">this</span>._s); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">current selection</span>
    
    <span style="color: #8b1a1a;">this</span>._opsStatus = ACTIVE_NONE;        
    <span style="color: #8b1a1a;">this</span>._queuedCommand = <span style="color: #0000FF;">function</span> () {};
  };

  <span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">ACTIVE_NONE</span> = 0, <span style="color: #BA36A5;">ACTIVE_FILTER</span> = 1, <span style="color: #BA36A5;">ACTIVE_SHIFT_CLICK_OR_SET_PATH</span> = 2;
  <span style="color: #0000FF;">const</span> <span style="color: #BA36A5;">C_SHIFT_CLICK</span> = 0, <span style="color: #BA36A5;">C_SET_PATH</span> = 1;
</pre>
</div>

<p>
The elements of the <i>selection state tuple</i> described 
in the manuscript are represented by <code>SelectionState</code>&rsquo;s member
variables:
</p>

<ol class="org-ol">
<li><code>_s</code> is the selection mapping,</li>
<li><code>_ops</code> is the composition of primitive selection operations (it
is an invariant that <code>_ops</code> always has an even number of
selection operations),</li>
<li><code>_spath</code> is the selection path,</li>
<li><code>_cursor</code> is the keyboard cursor, and</li>
<li><code>_opsStatus</code> is an indicator of whether the topmost selection
operation is <i>active</i> (open for modification) and for which command. It can
take values <code>ACTIVE_NONE</code>, <code>ACTIVE_SHIFT_CLICK_OR_SET_PAHT</code>, or <code>ACTIVE_FILTER</code>.
If the status is <code>ACTIVE_NONE</code>, then both shift-click/set path and filter
methods will first add a new empty pair of selection operators to
<code>_ops</code>.  If it is <code>ACTIVE_SHIFT_CLICK</code>, then shift-click or set path will not
add a new pair, but filter will. The roles are reversed with
<code>ACTIVE_FILTER</code>.</li>
</ol>


<p>
The <code>_redoStack</code> variable contains the redoable commands (selection
operations).  The <code>_current</code> variable is bound to the value
<code>_ops(_s)</code>, and it is thus the selection mapping that reflects the
current selection status of the elements. Finally, <code>_queuedCommand</code> is
a one-element command queue, which is used in combining several
consecutive shift-click operations, or several consequtive set path
operations, to one.
</p>
</div>
