org/multiselect_library.org
** Accessing the selection state of elements

The selection state of the element at index ~i~ is given by the
~isSelected(i)~ function:

#+NAME: selection-state-is-selected
#+BEGIN_SRC js 
  SelectionState.prototype.isSelected = function (i) { 
    this._flush();
    return this._current(i); 
  }
#+END_SRC

The ~_flush~ method is described with the shift-click command; its purpose is
to complete a possibly pending selection operation stored in ~_queuedCommand~.
The flush is called at the beginning of many of the methods of ~SelectionState~.

The ~selected~ function constructs a ~Set~ consisting of the currently selected
elements.  To determine which elements are selected, it suffices to
inspect the elements that are selected in the base selection mapping
and elements that are in the domain of the current composition. The
iteration order of the resulting ~Set~ offers no useful guarantees.

#+NAME: selection-state-selected
#+BEGIN_SRC js 
  SelectionState.prototype.selected = function () {
    this._flush();
    var J = makeEmptySet();
    for (var i of this._s.selected()) if (this._current(i)) J.add(i);
    for (var i of this._ops.domain.keys()) if (this._current(i)) J.add(i);
    return J;
  }
#+END_SRC

** Click functions

The three basic selection commands are ~click(p)~, ~cmdClick(p)~, and
~shiftClick(p)~.  They follow the specification in the manuscript,
with a couple additional details. 

*** Click 

The ~click(vp)~ function expects a selection space coordinate, which
will (usually) become the new anchor and the new keyboard cursor.  The
method clears the selection path, then extends the empty path with
~vp~.  The selection geometry's ~extendPath~ method may still leave
the path empty---some geometries will have coordinate values that
should not be stored to the selection path, such as points outside any
selectable element.  The ~extendPath~ must return ~null~ if ~path~
is not changed. If the selection path is left empty, the anchor is
undefined and the keyboard cursor remains unchanged.

#+NAME: selection-state-click
#+BEGIN_SRC js 
  SelectionState.prototype.click = function(vp) {
    this._flush();
    this._spath = []; 
    if (this._geometry.extendPath(this._spath, vp) !== null) this._cursor = vp;

    var J1 = this._callSelectionDomain(this._spath);

    if (clickIsNop.call(this, J1)) return this;

    var J0 = makeEmptyMap();
    for (var i of this._s.selected()) if (this._current(i)) J0.set(i, true);
    for (var i of this._ops.domain.keys()) if (this._current(i)) J0.set(i, true);

    this._ops.push(makeOp(ff, J0));
    this._ops.push(makeOp(tt, J1));
    this._bake();

    this._opsStatus = ACTIVE_SHIFT_CLICK_OR_SET_PATH;

    if (this._tracking) this._refresh(mapSymmetricDifference(J0, J1, false, true));
    else this._refresh(this._current);
    return this;
  };
#+END_SRC

A click command clears the current selection, then adds the
elements of the selection domain to the selection.  This effect is
achieved by pushing two selection operations: first ~ff~
over all selected elements, then ~tt~ over the new selection domain.

The ~callSelectionDomain~ method wraps a call to ~selectionMode~;
its details are explained below.

The helper function ~clickIsNop(J)~ detects clicks that would not have
any effect on the selection state. Such clicks are ignored to avoid
creating unnecessary undoable states. 

If ~_ops~ grows too big, [[#sec-baking][~_bake~]] reduces the size of ~_ops~
by one undoable operation (two selection operations).

The ~_opsStatus~ is set to ~ACTIVE_SHIFT_CLICK_OR_SET_PATH~ to
indicate that shift-click or set path can modify the topmost
selection operation that is pushed to ~_ops~.

Finally, the ~_refresh~ callback is invoked.  If tracking is on, its
argument is a newly constructed ~Map~ of the changed elements.  The
keys of the map indicate the changed elements, and the values their
current state (~true~ selected, ~false~ not selected).  If tracking is
off, the argument is the current selection mapping.

**** Detecting a nop

Assume ~op1~ and ~op2~ are the two tompost selection operations of the ~_ops~ composition.

Then, if the most recent command was

  - click, ~op1.f~ is ~tt~ and ~op2.f~ is ~ff~;
  - command-click, ~op1.f~ is either ~tt~ or ~ff~ and ~op2.f~ is ~id~;
  - any other command, either the conditions of click or command-click hold.

A click is deemed a nop if the previous command was also a click, and 
if the new selection domain is equal to the previous one:

#+NAME: click-is-nop
#+BEGIN_SRC js 
  function clickIsNop(J) {      
    return this._ops.size() >= 2 &&
      this._ops.top2().f === ff && this._ops.top().f === tt && 
      equalKeys(J, this._ops.top().domain);
  }  
#+END_SRC

A command-click operation toggles, so for it to have no effect, ~J~ must
be empty. Though this guarantees no change to elements' selection
status, it is not yet a suffcient condition for a nop, since the
selection mode may have to change. (This case results to indistinguishable
undo states.)

#+NAME: cmd-click-is-nop
#+BEGIN_SRC js 
  function cmdClickIsNop(J, mode) {      
    return this._ops.size() >= 2 &&
      this._ops.top2().f === id && this._ops.top().f === mode &&
      isEmpty(J) && isEmpty(this._ops.top().domain);
  }  
#+END_SRC

The above rules can let equivalent undo states through in rare cases.
It would be possible to add additional checking to the undo operation, 
but it is perhaps not worth the complication.

