dist-docs/library/multiselect_library.html

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Accessing the selection state of elements</h3>
<div class="outline-text-3" id="text-6-1">
<p>
The selection state of the element at index <code>i</code> is given by the
<code>isSelected(i)</code> function:
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-is-selected">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.isSelected = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">i</span>) { 
    <span style="color: #8b1a1a;">this</span>._flush();
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._current(i); 
  }
</pre>
</div>

<p>
The <code>_flush</code> method is described with the shift-click command; its purpose is
to complete a possibly pending selection operation stored in <code>_queuedCommand</code>.
The flush is called at the beginning of many of the methods of <code>SelectionState</code>.
</p>

<p>
The <code>selected</code> function constructs a <code>Set</code> consisting of the currently selected
elements.  To determine which elements are selected, it suffices to
inspect the elements that are selected in the base selection mapping
and elements that are in the domain of the current composition. The
iteration order of the resulting <code>Set</code> offers no useful guarantees.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-selected">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.selected = <span style="color: #0000FF;">function</span> () {
    <span style="color: #8b1a1a;">this</span>._flush();
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">J</span> = makeEmptySet();
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of <span style="color: #8b1a1a;">this</span>._s.selected()) <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._current(i)) J.add(i);
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of <span style="color: #8b1a1a;">this</span>._ops.domain.keys()) <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._current(i)) J.add(i);
    <span style="color: #0000FF;">return</span> J;
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Click functions</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The three basic selection commands are <code>click(p)</code>, <code>cmdClick(p)</code>, and
<code>shiftClick(p)</code>.  They follow the specification in the manuscript,
with a couple additional details. 
</p>
</div>

<div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Click</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
The <code>click(vp)</code> function expects a selection space coordinate, which
will (usually) become the new anchor and the new keyboard cursor.  The
method clears the selection path, then extends the empty path with
<code>vp</code>.  The selection geometry&rsquo;s <code>extendPath</code> method may still leave
the path empty&#x2014;some geometries will have coordinate values that
should not be stored to the selection path, such as points outside any
selectable element.  The <code>extendPath</code> must return <code>null</code> if <code>path</code>
is not changed. If the selection path is left empty, the anchor is
undefined and the keyboard cursor remains unchanged.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-click">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.click = <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">vp</span>) {
    <span style="color: #8b1a1a;">this</span>._flush();
    <span style="color: #8b1a1a;">this</span>._spath = []; 
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._geometry.extendPath(<span style="color: #8b1a1a;">this</span>._spath, vp) !== <span style="color: #8b1a1a;">null</span>) <span style="color: #8b1a1a;">this</span>._cursor = vp;

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">J1</span> = <span style="color: #8b1a1a;">this</span>._callSelectionDomain(<span style="color: #8b1a1a;">this</span>._spath);

    <span style="color: #0000FF;">if</span> (clickIsNop.call(<span style="color: #8b1a1a;">this</span>, J1)) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">J0</span> = makeEmptyMap();
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of <span style="color: #8b1a1a;">this</span>._s.selected()) <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._current(i)) J0.set(i, <span style="color: #8b1a1a;">true</span>);
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of <span style="color: #8b1a1a;">this</span>._ops.domain.keys()) <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._current(i)) J0.set(i, <span style="color: #8b1a1a;">true</span>);

    <span style="color: #8b1a1a;">this</span>._ops.push(makeOp(ff, J0));
    <span style="color: #8b1a1a;">this</span>._ops.push(makeOp(tt, J1));
    <span style="color: #8b1a1a;">this</span>._bake();

    <span style="color: #8b1a1a;">this</span>._opsStatus = ACTIVE_SHIFT_CLICK_OR_SET_PATH;

    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) <span style="color: #8b1a1a;">this</span>._refresh(mapSymmetricDifference(J0, J1, <span style="color: #8b1a1a;">false</span>, <span style="color: #8b1a1a;">true</span>));
    <span style="color: #0000FF;">else</span> <span style="color: #8b1a1a;">this</span>._refresh(<span style="color: #8b1a1a;">this</span>._current);
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  };
</pre>
</div>

<p>
A click command clears the current selection, then adds the
elements of the selection domain to the selection.  This effect is
achieved by pushing two selection operations: first <code>ff</code>
over all selected elements, then <code>tt</code> over the new selection domain.
</p>

<p>
The <code>callSelectionDomain</code> method wraps a call to <code>selectionMode</code>;
its details are explained below.
</p>

<p>
The helper function <code>clickIsNop(J)</code> detects clicks that would not have
any effect on the selection state. Such clicks are ignored to avoid
creating unnecessary undoable states. 
</p>

<p>
If <code>_ops</code> grows too big, <i><code>_bake</code></i> reduces the size of <code>_ops</code>
by one undoable operation (two selection operations).
</p>

<p>
The <code>_opsStatus</code> is set to <code>ACTIVE_SHIFT_CLICK_OR_SET_APTH</code> to
indicate that shift-click or set path can modify the topmost
selection operation that is pushed to <code>_ops</code>.
</p>

<p>
Finally, the <code>_refresh</code> callback is invoked.  If tracking is on, its
argument is a newly constructed <code>Map</code> of the changed elements.  The
keys of the map indicate the changed elements, and the values their
current state (<code>true</code> selected, <code>false</code> not selected).  If tracking is
off, the argument is the current selection mapping.
</p>
</div>

<ol class="org-ol"><li><a id="sec-6-2-1-1"></a>Detecting a nop<br  /><div class="outline-text-5" id="text-6-2-1-1">
<p>
Assume <code>op1</code> and <code>op2</code> are the two tompost selection operations of the <code>_ops</code> composition.
</p>

<p>
Then, if the most recent command was
</p>

<ul class="org-ul">
<li>click, <code>op1.f</code> is <code>tt</code> and <code>op2.f</code> is <code>ff</code>;</li>
<li>command-click, <code>op1.f</code> is either <code>tt</code> or <code>ff</code> and <code>op2.f</code> is <code>id</code>;</li>
<li>any other command, either the conditions of click or command-click hold.</li>
</ul>

<p>
A click is deemed a nop if the previous command was also a click, and 
if the new selection domain is equal to the previous one:
</p>

<div class="org-src-container">

<pre class="src src-js" id="click-is-nop">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">clickIsNop</span>(<span style="color: #BA36A5;">J</span>) {      
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._ops.size() &gt;= 2 &amp;&amp;
      <span style="color: #8b1a1a;">this</span>._ops.top2().f === ff &amp;&amp; <span style="color: #8b1a1a;">this</span>._ops.top().f === tt &amp;&amp; 
      equalKeys(J, <span style="color: #8b1a1a;">this</span>._ops.top().domain);
  }
</pre>
</div>

<p>
A command-click operation toggles, so for it to have no effect, <code>J</code> must
be empty. Though this guarantees no change to elements&rsquo; selection
status, it is not yet a suffcient condition for a nop, since the
selection mode may have to change. (This case results to indistinguishable
undo states.)
</p>

<div class="org-src-container">

<pre class="src src-js" id="cmd-click-is-nop">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">cmdClickIsNop</span>(<span style="color: #BA36A5;">J</span>, <span style="color: #BA36A5;">mode</span>) {      
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._ops.size() &gt;= 2 &amp;&amp;
      <span style="color: #8b1a1a;">this</span>._ops.top2().f === id &amp;&amp; <span style="color: #8b1a1a;">this</span>._ops.top().f === mode &amp;&amp;
      isEmpty(J) &amp;&amp; isEmpty(<span style="color: #8b1a1a;">this</span>._ops.top().domain);
  }
</pre>
</div>

<p>
The above rules can let equivalent undo states through in rare cases.
It would be possible to add additional checking to the undo operation, 
but it is perhaps not worth the complication.
</p>
</div></li></ol>
</div>
