org/multiselect_library.org
*** Command-click

The implementation differs from ~click~ on five counts: First, the
selection mode depends on whether the clicked point ~vp~ is on a
selected element or not. Second, command-clicking does not clear the
current selection. Third, the conditions for detecting a nop differ.
Fourth, computing which elements were changed is different.
The second parameter, ~selmode~, is an additional variation point that is
not used in typical selection geometries.

#+NAME: selection-state-cmd-click
#+BEGIN_SRC js 
  SelectionState.prototype.cmdClick = function (vp, selmode) {
    this._flush();
    this._spath = []; 
    if (this._geometry.extendPath(this._spath, vp) !== null) this._cursor = vp;

    var J = this._callSelectionDomain(this._spath);
    var mode;
    if (selmode === undefined) mode = this._onSelectedIndex(J) ? ff : tt;
    else mode = selmode ? tt : ff;

    if (cmdClickIsNop.call(this, J, mode)) return this;

    var changed = makeEmptyMap();
    if (this._tracking) {
      for (var i of J.keys()) {
        var state = this._current(i);
        if (state !== mode(state)) changed.set(i, mode(state));
      }
    }
    this._ops.push(makeOp(id, makeEmptyMap()));
    this._ops.push(makeOp(mode, J));
    this._bake();

    this._opsStatus = ACTIVE_SHIFT_CLICK_OR_SET_PATH;

    this._refresh(this._tracking ? changed : this._current);
    return this;
  }
#+END_SRC

The selection ~mode~ is either ~ff~ or ~tt~, and determined by whether
the point ~vp~ is considered to be on an element that is selected, or
not. This determination is made by ~_onSelectedIndex(J)~, which
returns ~true~ exactly when ~J~ contains exactly one index and that
index is selected.

The selection mode can also be set explicitly; if the second parameter
~selmode~ is ~true~, the selection mode is set to ~tt~, and if 
~false~, to ~ff~. This mechanism is meant for applications that
have a "non-standard" way of choosing the selection mode, such as 
a particular modifier key to deselect.

For tracking changes, it suffices to consider the indices in ~J~.  The
current selection state of each index is compared to what
the state will be, ~mode(state)~, when the new primitive operations
have been pushed to ~_ops~. If those states differ, the index is added
to ~changed~.

