dist-docs/library/multiselect_library.html

<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Command-click</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
The implementation differs from <code>click</code> on five counts: First, the
selection mode depends on whether the clicked point <code>vp</code> is on a
selected element or not. Second, command-clicking does not clear the
current selection. Third, the conditions for detecting a nop differ.
Fourth, computing which elements were changed is different.
The second parameter, <code>selmode</code>, is an additional variation point that is
not used in typical selection geometries.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-cmd-click">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.cmdClick = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">vp</span>, <span style="color: #BA36A5;">selmode</span>) {
    <span style="color: #8b1a1a;">this</span>._flush();
    <span style="color: #8b1a1a;">this</span>._spath = []; 
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._geometry.extendPath(<span style="color: #8b1a1a;">this</span>._spath, vp) !== <span style="color: #8b1a1a;">null</span>) <span style="color: #8b1a1a;">this</span>._cursor = vp;

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">J</span> = <span style="color: #8b1a1a;">this</span>._callSelectionDomain(<span style="color: #8b1a1a;">this</span>._spath);
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">mode</span>;
    <span style="color: #0000FF;">if</span> (selmode === <span style="color: #8b1a1a;">undefined</span>) mode = <span style="color: #8b1a1a;">this</span>._onSelectedIndex(J) ? ff : tt;
    <span style="color: #0000FF;">else</span> mode = selmode ? tt : ff;

    <span style="color: #0000FF;">if</span> (cmdClickIsNop.call(<span style="color: #8b1a1a;">this</span>, J, mode)) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">changed</span> = makeEmptyMap();
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) {
      <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of J.keys()) {
        <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">state</span> = <span style="color: #8b1a1a;">this</span>._current(i);
        <span style="color: #0000FF;">if</span> (state !== mode(state)) changed.set(i, mode(state));
      }
    }
    <span style="color: #8b1a1a;">this</span>._ops.push(makeOp(id, makeEmptyMap()));
    <span style="color: #8b1a1a;">this</span>._ops.push(makeOp(mode, J));
    <span style="color: #8b1a1a;">this</span>._bake();

    <span style="color: #8b1a1a;">this</span>._opsStatus = ACTIVE_SHIFT_CLICK_OR_SET_PATH;

    <span style="color: #8b1a1a;">this</span>._refresh(<span style="color: #8b1a1a;">this</span>._tracking ? changed : <span style="color: #8b1a1a;">this</span>._current);
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  }
</pre>
</div>

<p>
The selection <code>mode</code> is either <code>ff</code> or <code>tt</code>, and determined by whether
the point <code>vp</code> is considered to be on an element that is selected, or
not. This determination is made by <code>_onSelectedIndex(J)</code>, which
returns <code>true</code> exactly when <code>J</code> contains exactly one index and that
index is selected.
</p>

<p>
The selection mode can also be set explicitly; if the second parameter
<code>selmode</code> is <code>true</code>, the selection mode is set to <code>tt</code>, and if 
<code>false</code>, to <code>ff</code>. This mechanism is meant for applications that
have a &ldquo;non-standard&rdquo; way of choosing the selection mode, such as 
a particular modifier key to deselect.
</p>

<p>
For tracking changes, it suffices to consider the indices in <code>J</code>.  The
current selection state of each index is compared to what
the state will be, <code>mode(state)</code>, when the new primitive operations
have been pushed to <code>_ops</code>. If those states differ, the index is added
to <code>changed</code>.
</p>
</div>
</div>
