org/multiselect_library.org
*** Shift-click

The semantics of shift-clicking guarantees that that the effect of two
consecutive shift-clicks, say, at points $p_1$ and $p_2$, is the same
as first extending the selection path with $p_1$, then shift-clicking
at $p_2$.  To take advantage of this property when many shift-click
events happen in rapid succession, a shift-click command is queued,
instead of executed immediately.  At most one command can be queued at
a time.

#+NAME: selection-state-shift-click
#+BEGIN_SRC js 
  SelectionState.prototype.shiftClick = function (vp) {

    if (this._geometry.extendPath(this._spath, vp) === null) return this;
    this._cursor = this._spath[this._spath.length-1];

    if (this._queuedCommand.pending && 
        this._queuedCommand.type === C_SHIFT_CLICK) return this;
    else this._flush();

    this._queuedCommand = mkDelayedCommand(this, C_SHIFT_CLICK);
    setTimeout(this._queuedCommand, 0);
    return this;
  }
#+END_SRC

Shift-click first extends the selection path and sets the cursor,
except in the case that ~vp~ did not change the selection path.  Not
setting the cursor seems to be the natural behavior.  Consider
geometries where every selection space point is bound to some index,
and some mouse locations (such as those outside the extents of any
element) map to, say, ~null~.  In such a (likely common) setting,
dragging the mouse past an element to a ~null~ location during a
rubber band selection would cause the cursor location to be lost.

If a shift-click command is currently pending, nothing more needs to
be done. Eventually that pending command will get to execute, with the
selection path that was just extended with ~vp~.  In the case where
either no commands are pending or another kind of command (there is
only one possibility: /set path/) is pending, the queue is flushed,
and a new command is created with ~mkDelayedCommand~ and scheduled.

#+NAME: mk-delayed-command
#+BEGIN_SRC js 
  function mkDelayedCommand(sel, cmdType) {
    var cmd = function () {
      if (cmd.pending === false) return null;
      cmd.pending = false;

      if (sel._opsStatus !== ACTIVE_SHIFT_CLICK_OR_SET_PATH) { 
        sel._opsStatus = ACTIVE_SHIFT_CLICK_OR_SET_PATH; 
        sel._addEmptyPair(); 
      }

      var changed = makeEmptyMap();
      var op = sel._ops.pop();
      var mode = op.f;

      var oldJ = sel._tracking ? copyMap(op.domain) : op.domain;

      var J = sel._callSelectionDomain(sel._spath, oldJ, cmdType);

      if (sel._tracking) {
        mapSymmetricDifference(J, op.domain, true, false).forEach((function(value, i) {
          var tmp = sel._current(i);
          if (mode(tmp) === tmp) return;
          if (value) changed.set(i, mode(tmp)); else changed.set(i, tmp);
        }).bind(sel));
      }

      sel._ops.push(makeOp(mode, J));
      sel._refresh(sel._tracking ? changed : sel._current);
    };

    cmd.pending = true;
    cmd.type = cmdType;
    return cmd;
  }
#+END_SRC

The parameters to ~mkDelayedcommand~ are the selection state ~sel~ and
the a command type (~C_SHIFT_CLICK~ or ~C_SET_PATH~). 
The function constructs a command, marks it as pending, remembers the
method that created the command, and returns the constructed command.

Due to how the scheduling is arranged, a command may be executed more
than once.  Therefore the command tests first if it is still pending
or not, and returns immediately if it has already been executed.  When
the command gets to be executed, it must check whether to add a new
empty pair of selection operations. This is necessary, for example,
after ~undo~, ~redo~, and ~reset~, but must not be done after a click,
command-click or another shift-click.  This mechanism is to prevent
shift-click from overwriting a selection domain that is in an already
"committed" state.

After popping the topmost ~_ops~ element, the selection domain is
calculated; the old selection domain is passed as a hint to the
selection domain calculations. The ~selectionDomain~ function is
allowed to modify the hint parameter ~oldJ~. If tracking is on, such
modifications would cause errors, and we first thus take a copy of
~oldJ~. The details of calling ~selectionDomain~ are in
the ~_callSelectionDomain~ function, explained below.

The effect of the ~pop~ and ~push~ calls is to change the
domain of the topmost selection operation, and thus to modify the
current selection domain. The selection function of the operation
remains the same. 

The logic of tracking changes is as follows. Since shift-click only
modifies the selection domain (~op.domain~ is replaced with ~J~), the
only indices that need to be inspected are those that belong to ~J~
but not to ~op.domain~ (added indices), and those that belong to
~op.domain~ but not ~J~ (removed indices).  We construct a symmetric
difference map of these indices, where added indices have the value
~true~ and removed the value ~false~.  Then we detect if the current
selection function (~mode~) changes those values, and if so, set the
corresponding index in ~changed~ to the new value.

