dist-docs/library/multiselect_library.html

<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> Shift-click</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
The semantics of shift-clicking guarantees that that the effect of two
consecutive shift-clicks, say, at points \(p_1\) and \(p_2\), is the same
as first extending the selection path with \(p_1\), then shift-clicking
at \(p_2\).  To take advantage of this property when many shift-click
events happen in rapid succession, a shift-click command is queued,
instead of executed immediately.  At most one command can be queued at
a time.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-shift-click">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.shiftClick = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">vp</span>) {

    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._geometry.extendPath(<span style="color: #8b1a1a;">this</span>._spath, vp) === <span style="color: #8b1a1a;">null</span>) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
    <span style="color: #8b1a1a;">this</span>._cursor = <span style="color: #8b1a1a;">this</span>._spath[<span style="color: #8b1a1a;">this</span>._spath.length-1];

    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._queuedCommand.pending &amp;&amp; 
        <span style="color: #8b1a1a;">this</span>._queuedCommand.type === C_SHIFT_CLICK) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
    <span style="color: #0000FF;">else</span> <span style="color: #8b1a1a;">this</span>._flush();

    <span style="color: #8b1a1a;">this</span>._queuedCommand = mkDelayedCommand(<span style="color: #8b1a1a;">this</span>, C_SHIFT_CLICK);
    setTimeout(<span style="color: #8b1a1a;">this</span>._queuedCommand, 0);
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  }
</pre>
</div>

<p>
Shift-click first extends the selection path and sets the cursor,
except in the case that <code>vp</code> did not change the selection path.  Not
setting the cursor seems to be the natural behavior.  Consider
geometries where every selection space point is bound to some index,
and some mouse locations (such as those outside the extents of any
element) map to, say, <code>null</code>.  In such a (likely common) setting,
dragging the mouse past an element to a <code>null</code> location during a
rubber band selection would cause the cursor location to be lost.
</p>

<p>
If a shift-click command is currently pending, nothing more needs to
be done. Eventually that pending command will get to execute, with the
selection path that was just extended with <code>vp</code>.  In the case where
either no commands are pending or another kind of command (there is
only one possibility: <i>set path</i>) is pending, the queue is flushed,
and a new command is created with <code>mkDelayedCommand</code> and scheduled.
</p>

<div class="org-src-container">

<pre class="src src-js" id="mk-delayed-command">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">mkDelayedCommand</span>(<span style="color: #BA36A5;">sel</span>, <span style="color: #BA36A5;">cmdType</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">cmd</span> = <span style="color: #0000FF;">function</span> () {
      <span style="color: #0000FF;">if</span> (cmd.pending === <span style="color: #8b1a1a;">false</span>) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">null</span>;
      cmd.pending = <span style="color: #8b1a1a;">false</span>;

      <span style="color: #0000FF;">if</span> (sel._opsStatus !== ACTIVE_SHIFT_CLICK_OR_SET_PATH) { 
        sel._opsStatus = ACTIVE_SHIFT_CLICK_OR_SET_PATH; 
        sel._addEmptyPair(); 
      }

      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">changed</span> = makeEmptyMap();
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op</span> = sel._ops.pop();
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">mode</span> = op.f;

      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">oldJ</span> = sel._tracking ? copyMap(op.domain) : op.domain;

      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">J</span> = sel._callSelectionDomain(sel._spath, cmdType, oldJ);

      <span style="color: #0000FF;">if</span> (sel._tracking) {
        mapSymmetricDifference(J, op.domain, <span style="color: #8b1a1a;">true</span>, <span style="color: #8b1a1a;">false</span>).forEach((<span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">value</span>, <span style="color: #BA36A5;">i</span>) {
          <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">tmp</span> = sel._current(i);
          <span style="color: #0000FF;">if</span> (mode(tmp) === tmp) <span style="color: #0000FF;">return</span>;
          <span style="color: #0000FF;">if</span> (value) changed.set(i, mode(tmp)); <span style="color: #0000FF;">else</span> changed.set(i, tmp);
        }).bind(sel));
      }

      sel._ops.push(makeOp(mode, J));
      sel._refresh(sel._tracking ? changed : sel._current);
    };

    cmd.pending = <span style="color: #8b1a1a;">true</span>;
    cmd.type = cmdType;
    <span style="color: #0000FF;">return</span> cmd;
  }
</pre>
</div>

<p>
The parameters to <code>mkDelayedcommand</code> are the selection state <code>sel</code> and
the a command type (<code>C_SHIFT_CLICK</code> or <code>C_SET_PATH</code>). 
The function constructs a command, marks it as pending, remembers the
method that created the command, and returns the constructed command.
</p>

<p>
Due to how the scheduling is arranged, a command may be executed more
than once.  Therefore the command tests first if it is still pending
or not, and returns immediately if it has already been executed.  When
the command gets to be executed, it must check whether to add a new
empty pair of selection operations. This is necessary, for example,
after <code>undo</code>, <code>redo</code>, and <code>reset</code>, but must not be done after a click,
command-click or another shift-click.  This mechanism is to prevent
shift-click from overwriting a selection domain that is in an already
&ldquo;committed&rdquo; state.
</p>

<p>
After popping the topmost <code>_ops</code> element, the selection domain is
calculated; the old selection domain is passed as a hint to the
selection domain calculations. The <code>selectionDomain</code> function is
allowed to modify the hint parameter <code>oldJ</code>. If tracking is on, such
modifications would cause errors, and we first thus take a copy of
<code>oldJ</code>. The details of calling <code>selectionDomain</code> are in
the <code>_callSelectionDomain</code> function, explained below.
</p>

<p>
The effect of the <code>pop</code> and <code>push</code> calls is to change the
domain of the topmost selection operation, and thus to modify the
current selection domain. The selection function of the operation
remains the same. 
</p>

<p>
The logic of tracking changes is as follows. Since shift-click only
modifies the selection domain (<code>op.domain</code> is replaced with <code>J</code>), the
only indices that need to be inspected are those that belong to <code>J</code>
but not to <code>op.domain</code> (added indices), and those that belong to
<code>op.domain</code> but not <code>J</code> (removed indices).  We construct a symmetric
difference map of these indices, where added indices have the value
<code>true</code> and removed the value <code>false</code>.  Then we detect if the current
selection function (<code>mode</code>) changes those values, and if so, set the
corresponding index in <code>changed</code> to the new value.
</p>
</div>
</div>
