org/multiselect_library.org
*** Call selection domain

#+NAME: selection-state-call-selection-domain
#+BEGIN_SRC js 
  SelectionState.prototype._callSelectionDomain = function (path, J, cmdType) {
    if (cmdType === undefined || cmdType !== this._previousCmdType) {
      this._previousCmdType = cmdType;
      if (path.length === 0) return makeEmptyMap();
      return this._geometry.selectionDomain(path);
    } else {
      if (path.length === 0) return makeEmptyMap();
      return this._geometry.selectionDomain(path, J);
    }
  }
#+END_SRC

The client should define ~selectionDomain~ function in such a way that
if it is called with no arguments other than a selection path, it
correctly computes the selection domain. The second argument
enables taking advantage of the result of the previous call to
~selectionDomain~, which is beneficial in some selection
geometries. This possibility exists in two calling contexts, in the
command objects created either in the ~shiftClick~ or ~setPath~
methods. The purpose of ~_callSelectionDomain~ is to only pass the
previous result to ~selectionDomain~ if the source
of the call is the same as the source of the previous call.

Note that ~_callSelectionDomain~ takes care of the empty path
case, so that ~selectionDomain~ functions can assume they
are never called with an empty path.

*** Flush

The ~_flush~ method is simply a call to the queued command. Flushing
does not remove the queued command object; it may still be executed
later by the main event loop or another call to ~_flush~. Hence, each
command must know how to behave if executed more than once (they
should be no-ops). Only ~shiftClick~ and ~setPath~ methods schedule
commands.

#+NAME: selection-state-flush
#+BEGIN_SRC js 
  SelectionState.prototype._flush = function () { 
    this._queuedCommand();
  }
#+END_SRC

** Manipulating the selection path

The purpose of the ~setPath~ function is to make it possible to
implement geometry-specific means to modify the current selection path
directly.  For example, the visualization of a lasso selection could
make the corners of the lasso-polygon visible and draggable, so that
the user could directly manipulate the selection path.  This would
require modifying an aribtrary point of the selection path, not just
adding a point at the end.

This function is very similar to shift-click, except that instead of
extending the selection path with a new point, it replaces the entire
path.  Calls to ~setPath~ are queued the same way as those to ~shiftClick~,
so that consequtive calls can be combined.

#+NAME: selection-state-set-path
#+BEGIN_SRC js 
  SelectionState.prototype.setPath = function (path) {
    this._spath = path;
    this._cursor = activeEnd(path);

    if (this._queuedCommand.pending &&
        this._queuedCommand.type === C_SET_PATH) return this;
    else this._flush();

    this._queuedCommand = mkDelayedCommand(this, C_SET_PATH); 
    setTimeout(this._queuedCommand, 0);
    return this;
  }
#+END_SRC

** Analyzing elements under point

The ~onSelected(p)~ function determines if a selection space point ~p~
is on a selected element. Many selection contexts need this
functionality, e.g., to decide whether to interpret a click as a
selection operation or as a beginning of a drag-and-drop. The
~cmdClick~ function needs this same information for choosing between
selecting and deselecting, but to obtain the information it uses the
function ~_onSelectedIndex(J)~.  While ~onSelected~ calculates a
selection domain from a selection space coordinate, ~_onSelectedIndex~
uses directly the selection domain that ~cmdClick~ has already
computed.  Both functions return ~true~ exactly when the selection
domain (either computed or given as a parameter) is a singleton whose
only element is selected.

#+NAME: selection-state-on-selected
#+BEGIN_SRC js 
  SelectionState.prototype.onSelected = function (vp) {
    this._flush();
    var path = [];
    if (this._geometry.extendPath(path, vp) === null) return false;
    var J = this._callSelectionDomain(path);
    return this._onSelectedIndex(J);
  };

  SelectionState.prototype._onSelectedIndex = function (J) {
    return isSingleton(J) && this.isSelected(firstKey(J)); // isSelected calls _flush
  };
#+END_SRC

** Empty pairs 

#+NAME: selection-state-dummy-op-functions
#+BEGIN_SRC js 
  SelectionState.prototype._addEmptyPair = function () {
    this._ops.push(makeOp(id, makeEmptyMap()));
    this._ops.push(makeOp(tt, makeEmptyMap()));
  }
#+END_SRC

** Baking

The ~_bake~ function is a utility, called by ~click~ and ~cmdClick~ etc.,
to remove the oldest two selection operations from ~_ops~ 
when its maximum size is exceeded. 

#+NAME: selection-state-bake
#+BEGIN_SRC js 
  SelectionState.prototype._bake = function () {
    if (this._ops.size() > this._maxOps) {
      this._s.bake(this._ops.shift());
      this._s.bake(this._ops.shift());
    }
  }
#+END_SRC

