dist-docs/library/multiselect_library.html

<div id="outline-container-sec-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> Call selection domain</h4>
<div class="outline-text-4" id="text-6-2-4">
<div class="org-src-container">

<pre class="src src-js" id="selection-state-call-selection-domain">  SelectionState.<span style="color: #8b1a1a;">prototype</span>._callSelectionDomain = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">path</span>, <span style="color: #BA36A5;">cmdType</span>, <span style="color: #BA36A5;">J</span>) {
    <span style="color: #0000FF;">if</span> (cmdType === <span style="color: #8b1a1a;">undefined</span> || cmdType !== <span style="color: #8b1a1a;">this</span>._previousCmdType) {
      <span style="color: #8b1a1a;">this</span>._previousCmdType = cmdType;
      <span style="color: #0000FF;">if</span> (path.length === 0) <span style="color: #0000FF;">return</span> makeEmptyMap();
      <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._geometry.selectionDomain(path);
    } <span style="color: #0000FF;">else</span> {
      <span style="color: #0000FF;">if</span> (path.length === 0) <span style="color: #0000FF;">return</span> makeEmptyMap();
      <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._geometry.selectionDomain(path, cmdType, J);
    }
  }
</pre>
</div>

<p>
The client should define <code>selectionDomain</code> function in such a way that
if it is called with no arguments other than a selection path, it
correctly computes the selection domain. The other two arguments
enable taking advantage of the result of the previous call to
<code>selectionDomain</code>, which is beneficial in some selection
geometries. This possibility exists in two calling contexts, in the
command objects created either in the <code>shiftClick</code> or <code>setPath</code>
methods. The purpose of <code>_callSelectionDomain</code> is to only pass the
information about the previous result to <code>selectionDomain</code> if the source
of the call is the same as the source of the previous call.
</p>

<p>
Note that <code>_callSelectionDomain</code> takes care of the empty path
case, so that <code>selectionDomain</code> functions can assume they
are never called with an empty path.
</p>
</div>
</div>

<div id="outline-container-sec-6-2-5" class="outline-4">
<h4 id="sec-6-2-5"><span class="section-number-4">6.2.5</span> Flush</h4>
<div class="outline-text-4" id="text-6-2-5">
<p>
The <code>_flush</code> method is simply a call to the queued command. Flushing
does not remove the queued command object; it may still be executed
later by the main event loop or another call to <code>_flush</code>. Hence, each
command must know how to behave if executed more than once (they
should be no-ops). Only <code>shiftClick</code> and <code>setPath</code> methods schedule
commands.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-flush">  SelectionState.<span style="color: #8b1a1a;">prototype</span>._flush = <span style="color: #0000FF;">function</span> () { 
    <span style="color: #8b1a1a;">this</span>._queuedCommand();
  }
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Manipulating the selection path</h3>
<div class="outline-text-3" id="text-6-3">
<p>
The purpose of the <code>setPath</code> function is to make it possible to
implement geometry-specific means to modify the current selection path
directly.  For example, the visualization of a lasso selection could
make the corners of the lasso-polygon visible and draggable, so that
the user could directly manipulate the selection path.  This would
require modifying an aribtrary point of the selection path, not just
adding a point at the end.
</p>

<p>
This function is very similar to shift-click, except that instead of
extending the selection path with a new point, it replaces the entire
path.  Calls to <code>setPath</code> are queued the same way as those to <code>shiftClick</code>,
so that consequtive calls can be combined.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-set-path">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.setPath = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">path</span>) {
    <span style="color: #8b1a1a;">this</span>._spath = path;
    <span style="color: #8b1a1a;">this</span>._cursor = activeEnd(path);

    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._queuedCommand.pending &amp;&amp;
        <span style="color: #8b1a1a;">this</span>._queuedCommand.type === C_SET_PATH) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
    <span style="color: #0000FF;">else</span> <span style="color: #8b1a1a;">this</span>._flush();

    <span style="color: #8b1a1a;">this</span>._queuedCommand = mkDelayedCommand(<span style="color: #8b1a1a;">this</span>, C_SET_PATH); 
    setTimeout(<span style="color: #8b1a1a;">this</span>._queuedCommand, 0);
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Analyzing elements under point</h3>
<div class="outline-text-3" id="text-6-4">
<p>
The <code>onSelected(p)</code> function determines if a selection space point <code>p</code>
is on a selected element. Many selection contexts need this
functionality, e.g., to decide whether to interpret a click as a
selection operation or as a beginning of a drag-and-drop. The
<code>cmdClick</code> function needs this same information for choosing between
selecting and deselecting, but to obtain the information it uses the
function <code>_onSelectedIndex(J)</code>.  While <code>onSelected</code> calculates a
selection domain from a selection space coordinate, <code>_onSelectedIndex</code>
uses directly the selection domain that <code>cmdClick</code> has already
computed.  Both functions return <code>true</code> exactly when the selection
domain (either computed or given as a parameter) is a singleton whose
only element is selected.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-on-selected">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.onSelected = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">vp</span>) {
    <span style="color: #8b1a1a;">this</span>._flush();
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">path</span> = [];
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._geometry.extendPath(path, vp) === <span style="color: #8b1a1a;">null</span>) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">false</span>;
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">J</span> = <span style="color: #8b1a1a;">this</span>._callSelectionDomain(path);
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._onSelectedIndex(J);
  };

  SelectionState.<span style="color: #8b1a1a;">prototype</span>._onSelectedIndex = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">J</span>) {
    <span style="color: #0000FF;">return</span> isSingleton(J) &amp;&amp; <span style="color: #8b1a1a;">this</span>.isSelected(firstKey(J)); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">isSelected calls _flush</span>
  };
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Empty pairs</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-js" id="selection-state-dummy-op-functions">  SelectionState.<span style="color: #8b1a1a;">prototype</span>._addEmptyPair = <span style="color: #0000FF;">function</span> () {
    <span style="color: #8b1a1a;">this</span>._ops.push(makeOp(id, makeEmptyMap()));
    <span style="color: #8b1a1a;">this</span>._ops.push(makeOp(tt, makeEmptyMap()));
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Baking</h3>
<div class="outline-text-3" id="text-6-6">
<p>
The <code>_bake</code> function is a utility, called by <code>click</code> and <code>cmdClick</code> etc.,
to remove the oldest two selection operations from <code>_ops</code> 
when its maximum size is exceeded. 
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-bake">  SelectionState.<span style="color: #8b1a1a;">prototype</span>._bake = <span style="color: #0000FF;">function</span> () {
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._ops.size() &gt; <span style="color: #8b1a1a;">this</span>._maxOps) {
      <span style="color: #8b1a1a;">this</span>._s.bake(<span style="color: #8b1a1a;">this</span>._ops.shift());
      <span style="color: #8b1a1a;">this</span>._s.bake(<span style="color: #8b1a1a;">this</span>._ops.shift());
    }
  }
</pre>
</div>
</div>
</div>
