org/multiselect_library.org
** Undo and redo operations
  :PROPERTIES:
  :CUSTOM_ID: sec-undo-redo
  :END:

Undoing and redoing is simply removing from and adding to the
operation composition ~_ops~. Similar to other user operations, undo
and redo push and pop primitive selection operations in pairs.  Both
undo and redo leave the ~_ops~ stack in a state where the selection
path is empty. 

Both operations mark the commit status as ~ACTIVE_NONE~.  This is 
important. Assume it was not done.  After undo some earlier selection
operation ~op~ is at the top of ~_ops~. The selection path that
determined ~op~'s selection domain, however, is no longer available.
Click and command-click would still behave well as they would not
modify ~op~.  A shift-click at this state, however, would likely
produce surprising results---shift-click replaces the topmost
selection operation with a new operation that has a different domain,
and would thus cause seemingly random elements to become either
selected or unselected.  By setting the commit status to ~ACTIVE_NONE~,
shift-click is forced add a new empty pair of selection operations.

#+NAME: selection-state-undo-redo
#+BEGIN_SRC js 
  SelectionState.prototype.undo = function () {
    this._flush();
    this._spath = [];

    var changed = makeEmptyMap();
    if (this._ops.size() >= 2) {
      if (this._tracking) {
        for (var i of this._ops.top().domain.keys()) changed.set(i, this._current(i));
        for (var i of this._ops.top2().domain.keys()) changed.set(i, this._current(i));
      }
      this._redoStack.push(this._ops.pop());
      this._redoStack.push(this._ops.pop());
    }
    if (this._tracking) {
      for (var i of changed.keys()) {
        if (changed.get(i) === this._current(i)) changed.delete(i);
        else changed.set(i, this._current(i));
      }
    }

    // redoStack is not cleared ever,
    // so we limit its size (to same as undo stack's)
    if (this._redoStack.length > this._maxOps) {
      this._redoStack.shift();
      this._redoStack.shift();
    }
    this._opsStatus = ACTIVE_NONE;
    this._refresh(this._tracking ? changed : this._current);
    return this;
  }

  SelectionState.prototype.redo = function () {
    this._flush();
    this._spath = [];

    var changed = makeEmptyMap();
    if (this._redoStack.length >= 2) {
      var op = this._redoStack.pop();
      if (this._tracking) for (var i of op.domain.keys()) changed.set(i, this._current(i));
      this._ops.push(op);
      op = this._redoStack.pop();
      if (this._tracking) for (var i of op.domain.keys()) changed.set(i, this._current(i));
      this._ops.push(op);
    }
    if (this._tracking) {
      for (var i of changed.keys()) {
        if (changed.get(i) === this._current(i)) changed.delete(i);
        else changed.set(i, this._current(i));
      }
    }
    this._opsStatus = ACTIVE_NONE;
    this._refresh(this._tracking ? changed : this._current);
    return this;
  }
#+END_SRC

Undo and redo clear the selection path, but do not modify the cursor.
An alternative design choice would be to clear the cursor (set it to
~undefined~). It seems that there is no harm in keeping the value,
but there might be harm in clearing it if the user is solely
selecting with the keyboard.  One could imagine preserving the anchor
from the path; it could be useful in some cases, but it could also
lead to surprising behavior if the next command after undo was
shift-click.

Tracking changes in ~undo~ first constructs a candidate ~changed~ map
and populates it with elements that are in either of the two topmost
selection operations in ~_ops~. After popping the
operations, the elements that did not change are removed, and the
values of those that did are set to the current selection state.
Change tracking in ~redo~ is similar, except that the candidate
set is the union of domains of the two topmost selection 
operations in the redo stack.

The semantics of ~redo~ could be chosen differently; any click
operation could clear the entire ~redo~ stack.  We chose to not do
that, but instead every selection operation that is popped by
~undo~ is pushed to the redo stack; it is thus possible to, e.g., undo
twice, redo once, select more with various clicks, and then redo
again.  We do limit the redo stack size to the maximum size of the
undo stack. 
# Redoing a click command is an interesting case. 
# if undo then command then redo, could be that the redo click is
# not "clear all, then select" but rather "clear whatever was cleared
# the first time this command was given, then select"

