dist-docs/library/multiselect_library.html

<div id="outline-container-sec-undo-redo" class="outline-3">
<h3 id="sec-undo-redo"><a id="sec-6-7"></a><span class="section-number-3">6.7</span> Undo and redo operations</h3>
<div class="outline-text-3" id="text-sec-undo-redo">
<p>
Undoing and redoing is simply removing from and adding to the
operation composition <code>_ops</code>. Similar to other user operations, undo
and redo push and pop primitive selection operations in pairs.  Both
undo and redo leave the <code>_ops</code> stack in a state where the selection
path is empty. 
</p>

<p>
Both operations mark the commit status as <code>ACTIVE_NONE</code>.  This is 
important. Assume it was not done.  After undo some earlier selection
operation <code>op</code> is at the top of <code>_ops</code>. The selection path that
determined <code>op</code>&rsquo;s selection domain, however, is no longer available.
Click and command-click would still behave well as they would not
modify <code>op</code>.  A shift-click at this state, however, would likely
produce surprising results&#x2014;shift-click replaces the topmost
selection operation with a new operation that has a different domain,
and would thus cause seemingly random elements to become either
selected or unselected.  By setting the commit status to <code>ACTIVE_NONE</code>,
shift-click is forced add a new empty pair of selection operations.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-undo-redo">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.undo = <span style="color: #0000FF;">function</span> () {
    <span style="color: #8b1a1a;">this</span>._flush();
    <span style="color: #8b1a1a;">this</span>._spath = [];

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">changed</span> = makeEmptyMap();
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._ops.size() &gt;= 2) {
      <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) {
        <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of <span style="color: #8b1a1a;">this</span>._ops.top().domain.keys()) changed.set(i, <span style="color: #8b1a1a;">this</span>._current(i));
        <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of <span style="color: #8b1a1a;">this</span>._ops.top2().domain.keys()) changed.set(i, <span style="color: #8b1a1a;">this</span>._current(i));
      }
      <span style="color: #8b1a1a;">this</span>._redoStack.push(<span style="color: #8b1a1a;">this</span>._ops.pop());
      <span style="color: #8b1a1a;">this</span>._redoStack.push(<span style="color: #8b1a1a;">this</span>._ops.pop());
    }
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) {
      <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of changed.keys()) {
        <span style="color: #0000FF;">if</span> (changed.get(i) === <span style="color: #8b1a1a;">this</span>._current(i)) changed.<span style="color: #0000FF;">delete</span>(i);
        <span style="color: #0000FF;">else</span> changed.set(i, <span style="color: #8b1a1a;">this</span>._current(i));
      }
    }

    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">redoStack is not cleared ever,</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">so we limit its size (to same as undo stack's)</span>
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._redoStack.length &gt; <span style="color: #8b1a1a;">this</span>._maxOps) {
      <span style="color: #8b1a1a;">this</span>._redoStack.shift();
      <span style="color: #8b1a1a;">this</span>._redoStack.shift();
    }
    <span style="color: #8b1a1a;">this</span>._opsStatus = ACTIVE_NONE;
    <span style="color: #8b1a1a;">this</span>._refresh(<span style="color: #8b1a1a;">this</span>._tracking ? changed : <span style="color: #8b1a1a;">this</span>._current);
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  }

  SelectionState.<span style="color: #8b1a1a;">prototype</span>.redo = <span style="color: #0000FF;">function</span> () {
    <span style="color: #8b1a1a;">this</span>._flush();
    <span style="color: #8b1a1a;">this</span>._spath = [];

    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">changed</span> = makeEmptyMap();
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._redoStack.length &gt;= 2) {
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op</span> = <span style="color: #8b1a1a;">this</span>._redoStack.pop();
      <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of op.domain.keys()) changed.set(i, <span style="color: #8b1a1a;">this</span>._current(i));
      <span style="color: #8b1a1a;">this</span>._ops.push(op);
      op = <span style="color: #8b1a1a;">this</span>._redoStack.pop();
      <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of op.domain.keys()) changed.set(i, <span style="color: #8b1a1a;">this</span>._current(i));
      <span style="color: #8b1a1a;">this</span>._ops.push(op);
    }
    <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) {
      <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of changed.keys()) {
        <span style="color: #0000FF;">if</span> (changed.get(i) === <span style="color: #8b1a1a;">this</span>._current(i)) changed.<span style="color: #0000FF;">delete</span>(i);
        <span style="color: #0000FF;">else</span> changed.set(i, <span style="color: #8b1a1a;">this</span>._current(i));
      }
    }
    <span style="color: #8b1a1a;">this</span>._opsStatus = ACTIVE_NONE;
    <span style="color: #8b1a1a;">this</span>._refresh(<span style="color: #8b1a1a;">this</span>._tracking ? changed : <span style="color: #8b1a1a;">this</span>._current);
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  }
</pre>
</div>

<p>
Undo and redo clear the selection path, but do not modify the cursor.
An alternative design choice would be to clear the cursor (set it to
<code>undefined</code>). It seems that there is no harm in keeping the value,
but there might be harm in clearing it if the user is solely
selecting with the keyboard.  One could imagine preserving the anchor
from the path; it could be useful in some cases, but it could also
lead to surprising behavior if the next command after undo was
shift-click.
</p>

<p>
Tracking changes in <code>undo</code> first constructs a candidate <code>changed</code> map
and populates it with elements that are in either of the two topmost
selection operations in <code>_ops</code>. After popping the
operations, the elements that did not change are removed, and the
values of those that did are set to the current selection state.
Change tracking in <code>redo</code> is similar, except that the candidate
set is the union of domains of the two topmost selection 
operations in the redo stack.
</p>

<p>
The semantics of <code>redo</code> could be chosen differently; any click
operation could clear the entire <code>redo</code> stack.  We chose to not do
that, but instead every selection operation that is popped by
<code>undo</code> is pushed to the redo stack; it is thus possible to, e.g., undo
twice, redo once, select more with various clicks, and then redo
again.  We do limit the redo stack size to the maximum size of the
undo stack. 
</p>
</div>
</div>
