org/multiselect_library.org
** Selecting and deselecting with a predicate

Some applications provide means to select or deselect elements based
on properties of the elements, such as selecting all file names that
end with "~.pdf~".  The ~filter(predicate, state)~ method implements
this functionality.  It relies on the ~filter(predicate)~ method of
the geometry, which returns the subset of the indices that satisfy
~predicate~ as the selection domain.  If state is ~false~, the effect
is to deselect, otherwise to select.  A ~filter~ call following
another ~filter~ call with the same ~state~ rewrites the topmost
selection operation (so it behaves as shift-click in this sence); all
other calls first add a new pair of selection operations first.

#+NAME: selection-state-filter
#+BEGIN_SRC js
SelectionState.prototype.filter = function (predicate, state) {
  if (state !== false) mode = tt; else mode = ff;

  this._flush();
  this._spath = [];
  if (this._opsStatus !== ACTIVE_FILTER || 
      this._ops.size() >= 2 && this._ops.top().f !== mode) { // filter mode changed
    this._opsStatus = ACTIVE_FILTER; 
    this._addEmptyPair(); 
  }

  var changed = makeEmptyMap();
  var J = this._geometry.filter(predicate);
  var op = this._ops.pop();

  var self = this;
  if (this._tracking) {
    mapSymmetricDifference(J, op.domain, true, false).forEach((function(value, i) {
      var tmp = self._current(i);
      if (mode(tmp) === tmp) return;
      if (value) changed.set(i, mode(tmp)); else changed.set(i, tmp);
    }).bind(self));
  }

  this._ops.push(makeOp(mode, J));

  this._refresh(this._tracking ? changed : this._current);
  return this;
}
#+END_SRC

The ~commit~ function makes the current state not active, so that
shift-click, set-path, and filter operations will be forced to add a new 
selection operation pair.

#+NAME: selection-state-commit
#+BEGIN_SRC js
SelectionState.prototype.commit = function () {
  this._flush();
  this._opsStatus = ACTIVE_NONE;
}
#+END_SRC


** Set geometry

The geometry can be changed on the fly. The path and cursor
must then be reset and  a possible pending operation flushed.  
Further, a commit is necessary so that if the next operation is,
say, a shift-click, the
previously current selection domain is not ``hi-jacked''.

#+NAME: selection-state-set-geometry
#+BEGIN_SRC js
  SelectionState.prototype.setGeometry = function (geometry) {
    this._flush(); 
    this._spath = []; this._cursor = undefined;
    this.commit();
    this._geometry = geometry;
    return this;
  }
#+END_SRC

Even though the selection geometry _object_ does not change, the object may change
in such a way as to require resetting the selection path. For example, if the 
positions of selectable elements change on a window, then selection space points 
may no longer correspond to the same elements. The ~resetPath~ function 
is for this purpose.

#+NAME: selection-state-reset-path
#+BEGIN_SRC js
  SelectionState.prototype.resetPath = function () {
    this._flush(); 
    this._spath = []; this._cursor = undefined;
    this.commit();
    return this;
  }
#+END_SRC

FIXME: is there a way to catch a resize event and force a flush
before?  Otherwise it would be possible to get a resetPath
call where flush is called and a pending shift click called when
geometry object has already been modified.  (Very very unlikely in
practice, but in theory possible.)


** Access functions
   :PROPERTIES:
   :CUSTOM_ID: sec-access-cursor-data
   :END:

The following are the ``getter'' functions for 
the geometry, cursor, and selection path:

#+NAME: selection-state-getters
#+BEGIN_SRC js
SelectionState.prototype.geometry = function () { return this._geometry; }
SelectionState.prototype.cursor = function () { return this._cursor; }
SelectionState.prototype.selectionPath = function () { return this._spath; }
#+END_SRC

The client needs to access the geometry object for the ~m2v~ method
that transforms mouse coordinate points to selection space, and
possibly to obtain the cursor and selection path to visualize the keyboard
cursor, anchor, and rubber band. Other than making these pieces of data
readily available, {{{msjs}}} leaves the visualization to the client.

