dist-docs/library/multiselect_library.html

<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> Selecting and deselecting with a predicate</h3>
<div class="outline-text-3" id="text-6-8">
<p>
Some applications provide means to select or deselect elements based
on properties of the elements, such as selecting all file names that
end with &ldquo;<code>.pdf</code>&rdquo;.  The <code>filter(predicate, state)</code> method implements
this functionality.  It relies on the <code>filter(predicate)</code> method of
the geometry, which returns the subset of the indices that satisfy
<code>predicate</code> as the selection domain.  If state is <code>false</code>, the effect
is to deselect, otherwise to select.  A <code>filter</code> call following
another <code>filter</code> call with the same <code>state</code> rewrites the topmost
selection operation (so it behaves as shift-click in this sence); all
other calls first add a new pair of selection operations first.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-filter">SelectionState.<span style="color: #8b1a1a;">prototype</span>.filter = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">predicate</span>, <span style="color: #BA36A5;">state</span>) {
  <span style="color: #0000FF;">if</span> (state !== <span style="color: #8b1a1a;">false</span>) mode = tt; <span style="color: #0000FF;">else</span> mode = ff;

  <span style="color: #8b1a1a;">this</span>._flush();
  <span style="color: #8b1a1a;">this</span>._spath = [];
  <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._opsStatus !== ACTIVE_FILTER || 
      <span style="color: #8b1a1a;">this</span>._ops.size() &gt;= 2 &amp;&amp; <span style="color: #8b1a1a;">this</span>._ops.top().f !== mode) { <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">filter mode changed</span>
    <span style="color: #8b1a1a;">this</span>._opsStatus = ACTIVE_FILTER; 
    <span style="color: #8b1a1a;">this</span>._addEmptyPair(); 
  }

  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">changed</span> = makeEmptyMap();
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">J</span> = <span style="color: #8b1a1a;">this</span>._geometry.filter(predicate);
  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">op</span> = <span style="color: #8b1a1a;">this</span>._ops.pop();

  <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">self</span> = <span style="color: #8b1a1a;">this</span>;
  <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._tracking) {
    mapSymmetricDifference(J, op.domain, <span style="color: #8b1a1a;">true</span>, <span style="color: #8b1a1a;">false</span>).forEach((<span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">value</span>, <span style="color: #BA36A5;">i</span>) {
      <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">tmp</span> = self._current(i);
      <span style="color: #0000FF;">if</span> (mode(tmp) === tmp) <span style="color: #0000FF;">return</span>;
      <span style="color: #0000FF;">if</span> (value) changed.set(i, mode(tmp)); <span style="color: #0000FF;">else</span> changed.set(i, tmp);
    }).bind(self));
  }

  <span style="color: #8b1a1a;">this</span>._ops.push(makeOp(mode, J));

  <span style="color: #8b1a1a;">this</span>._refresh(<span style="color: #8b1a1a;">this</span>._tracking ? changed : <span style="color: #8b1a1a;">this</span>._current);
  <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
}
</pre>
</div>

<p>
The <code>commit</code> function makes the current state not active, so that
shift-click, set-path, and filter operations will be forced to add a new 
selection operation pair.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-commit">SelectionState.<span style="color: #8b1a1a;">prototype</span>.commit = <span style="color: #0000FF;">function</span> () {
  <span style="color: #8b1a1a;">this</span>._flush();
  <span style="color: #8b1a1a;">this</span>._opsStatus = ACTIVE_NONE;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> Set geometry</h3>
<div class="outline-text-3" id="text-6-9">
<p>
The geometry can be changed on the fly. The path and cursor
must then be reset and  a possible pending operation flushed.  
Further, a commit is necessary so that if the next operation is,
say, a shift-click, the
previously current selection domain is not ``hi-jacked&rsquo;&rsquo;.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-set-geometry">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.setGeometry = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">geometry</span>) {
    <span style="color: #8b1a1a;">this</span>._flush(); 
    <span style="color: #8b1a1a;">this</span>._spath = []; <span style="color: #8b1a1a;">this</span>._cursor = <span style="color: #8b1a1a;">undefined</span>;
    <span style="color: #8b1a1a;">this</span>.commit();
    <span style="color: #8b1a1a;">this</span>._geometry = geometry;
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  }
</pre>
</div>

<p>
Even though the selection geometry <span class="underline">object</span> does not change, the object may change
in such a way as to require resetting the selection path. For example, if the 
positions of selectable elements change on a window, then selection space points 
may no longer correspond to the same elements. The <code>resetPath</code> function 
is for this purpose.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-reset-path">  SelectionState.<span style="color: #8b1a1a;">prototype</span>.resetPath = <span style="color: #0000FF;">function</span> () {
    <span style="color: #8b1a1a;">this</span>._flush(); 
    <span style="color: #8b1a1a;">this</span>._spath = []; <span style="color: #8b1a1a;">this</span>._cursor = <span style="color: #8b1a1a;">undefined</span>;
    <span style="color: #8b1a1a;">this</span>.commit();
    <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  }
</pre>
</div>

<p>
FIXME: is there a way to catch a resize event and force a flush
before?  Otherwise it would be possible to get a resetPath
call where flush is called and a pending shift click called when
geometry object has already been modified.  (Very very unlikely in
practice, but in theory possible.)
</p>
</div>
</div>


<div id="outline-container-sec-access-cursor-data" class="outline-3">
<h3 id="sec-access-cursor-data"><a id="sec-6-10"></a><span class="section-number-3">6.10</span> Access functions</h3>
<div class="outline-text-3" id="text-sec-access-cursor-data">
<p>
The following are the ``getter&rsquo;&rsquo; functions for 
the geometry, cursor, and selection path:
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-getters">SelectionState.<span style="color: #8b1a1a;">prototype</span>.geometry = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._geometry; }
SelectionState.<span style="color: #8b1a1a;">prototype</span>.cursor = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._cursor; }
SelectionState.<span style="color: #8b1a1a;">prototype</span>.selectionPath = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._spath; }
</pre>
</div>

<p>
The client needs to access the geometry object for the <code>m2v</code> method
that transforms mouse coordinate points to selection space, and
possibly to obtain the cursor and selection path to visualize the keyboard
cursor, anchor, and rubber band. Other than making these pieces of data
readily available, MultiselectJS leaves the visualization to the client.
</p>
</div>
</div>
