org/multiselect_library.org
** Keyboard operations

Keyboard operations are simple wrappers over ~click~, ~cmdClick~ and
~shiftClick~ functions. Each of the ~space~ function has the same
effect as a similarly modified ~click~ function on the position
indicated by the keyboard cursor. If a cursor cannot be established,
however, we choose to do nothing (rather than call the corresponding
click method with ~undefined~). Because the keyboard operations
delegate to click methods, ~_flush~ calls are not needed.

#+NAME: selection-state-space-functions
#+BEGIN_SRC js 
function valueOrDefault(a, def) { return a === undefined ? def : a; }

SelectionState.prototype.space = function () {
  if (!this._acquireCursor(NO_DIRECTION)) return this;
  return this.click(this._cursor);
};
SelectionState.prototype.cmdSpace = function (dir) {
  if (!this._acquireCursor(valueOrDefault(dir, NO_DIRECTION))) return this;
  return this.cmdClick(this._cursor);
};
SelectionState.prototype.shiftSpace = function (dir) {
  if (!this._acquireCursor(valueOrDefault(dir, NO_DIRECTION))) return this; 
  return this.shiftClick(this._cursor);
};
#+END_SRC

The ~_acquireCursor(dir)~ function returns the current cursor if it is
not ~undefined~; otherwise it sets the cursor to a default value obtained
from the selection geometry; the default of that default is
~undefined~.  The ~dir~ parameter is one of ~UP~, ~DOWN~, ~LEFT~, ~RIGHT~
when called from the arrow functions and ~NO_DIRECTION~ when called
from the space functions.  The purpose of the ~dir~ parameter is to allow for a
different default for different arrow keys. For example, the default
for down arrow could be a point indicating the first index, and up arrow the last.

#+NAME: selection-state-acquire-cursor
#+BEGIN_SRC js 
  SelectionState.prototype._acquireCursor = function (dir) {
    this._cursor = valueOrDefault(this._cursor, this._geometry.defaultCursor(dir));
    return !(this._noCursor());
  }
  SelectionState.prototype._noCursor = function () { return this._cursor === undefined; }
#+END_SRC

Note that the client calls ~space~, ~cmdSpace~, or ~shiftSpace~
without an argument, and thus ~dir~ is undefined. Thus, if ~_cursor~ is
not defined, the default is queried with ~NO_DIRECTION~. The arrow
methods call the ~cmdSpace~ and ~shiftSpace~ methods with a direction
argument, and therefore the default is queried with that direction
value.

The arrow methods are as follows:

#+NAME: selection-state-arrow-functions
#+BEGIN_SRC js 
SelectionState.prototype.arrow = function (dir) {
  if (this._noCursor()) { this._acquireCursor(dir); return this; }
  this._cursor = this._geometry.step(dir, this._cursor);
  return this;
}
SelectionState.prototype.cmdArrow = function (dir) {
  if (this._noCursor()) return this.cmdSpace(dir);
  else return this.cmdSpace(dir).arrow(dir);
};
SelectionState.prototype.shiftArrow = function (dir) {
  if (this._noCursor()) return this.shiftSpace(dir);
  else return this.arrow(dir).shiftSpace(dir);
}
#+END_SRC

In all three arrow methods, if the cursor is undefined
the cursor position is taken to be whatever default the 
geometry provides. Shift-arrow does not move the 
cursor before the ~shiftSpace~ call and command-arrow 
does not move it after the ~cmdSpace~ call. This seems like
the most natural behavior.

*** Keyboard tests                                                 :noexport:

#+NAME: keyboard-tests
#+BEGIN_SRC js :exports none
  test ("Keyboard tests", function (t) {

    var s = new M.SelectionState(new M.VerticalCS(20), false, 10);
    function cur(i) { return s.isSelected(i); }
    s.space(); s.shiftSpace(); s.cmdSpace();
    s.arrow(M.UP); s.arrow(M.DOWN); s.arrow(M.LEFT); s.arrow(M.RIGHT); 
    s.cmdArrow(M.UP); s.cmdArrow(M.DOWN); s.cmdArrow(M.LEFT); s.cmdArrow(M.RIGHT); 
    s.shiftArrow(M.UP); s.shiftArrow(M.DOWN); s.shiftArrow(M.LEFT); s.shiftArrow(M.RIGHT); 
    // all of these should be no-ops, because there is no cursor yet
    // and the default geometry has no default for it
    t.equal(s._ops.size(), 2, "kbd 1");
    
    s.click(1); 
    t.equal(cur(1), true, "kbd 2");

    s.cmdSpace();
    t.equal(cur(1), false, "kbd 3");

    s.space();
    t.equal(cur(1), true, "kbd 4");

    s.shiftArrow(M.UP);     
    s.shiftArrow(M.UP);     // nop
    s.shiftArrow(M.UP);     // nop
    t.deepEqual([0, 1, 2].map(cur), [true, true, false], "kbd 5");

    s.shiftArrow(M.DOWN);    
    t.deepEqual([0, 1, 2].map(cur), [false, true, false], "kbd 6");

    s.cmdArrow(M.DOWN);
    t.deepEqual([0, 1, 2].map(cur), [false, false, false], "kbd 7");

    s.space();
    t.deepEqual([0, 1, 2].map(cur), [false, false, true], "kbd 8");

    s.arrow(M.UP); s.arrow(M.UP);
    s.cmdSpace();
    t.deepEqual([0, 1, 2].map(cur), [true, false, true], "kbd 9");

    s.shiftArrow(M.DOWN);
    s.shiftArrow(M.DOWN);
    t.deepEqual([0, 1, 2].map(cur), [true, true, true], "kbd 10");

    s.arrow(M.UP);
    s.shiftSpace();
    t.deepEqual([0, 1, 2].map(cur), [true, true, true], "kbd 11");

    s.arrow(M.UP);
    s.shiftSpace();
    t.deepEqual([0, 1, 2].map(cur), [true, false, true], "kbd 12");
  });
#+END_SRC


