dist-docs/library/multiselect_library.html

<div id="outline-container-sec-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="section-number-3">6.11</span> Keyboard operations</h3>
<div class="outline-text-3" id="text-6-11">
<p>
Keyboard operations are simple wrappers over <code>click</code>, <code>cmdClick</code> and
<code>shiftClick</code> functions. Each of the <code>space</code> function has the same
effect as a similarly modified <code>click</code> function on the position
indicated by the keyboard cursor. If a cursor cannot be established,
however, we choose to do nothing (rather than call the corresponding
click method with <code>undefined</code>). Because the keyboard operations
delegate to click methods, <code>_flush</code> calls are not needed.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-space-functions"><span style="color: #0000FF;">function</span> <span style="color: #006699;">valueOrDefault</span>(<span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">def</span>) { <span style="color: #0000FF;">return</span> a === <span style="color: #8b1a1a;">undefined</span> ? def : a; }

SelectionState.<span style="color: #8b1a1a;">prototype</span>.space = <span style="color: #0000FF;">function</span> () {
  <span style="color: #0000FF;">if</span> (!<span style="color: #8b1a1a;">this</span>._acquireCursor(NO_DIRECTION)) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>.click(<span style="color: #8b1a1a;">this</span>._cursor);
};
SelectionState.<span style="color: #8b1a1a;">prototype</span>.cmdSpace = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>) {
  <span style="color: #0000FF;">if</span> (!<span style="color: #8b1a1a;">this</span>._acquireCursor(valueOrDefault(dir, NO_DIRECTION))) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
  <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>.cmdClick(<span style="color: #8b1a1a;">this</span>._cursor);
};
SelectionState.<span style="color: #8b1a1a;">prototype</span>.shiftSpace = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>) {
  <span style="color: #0000FF;">if</span> (!<span style="color: #8b1a1a;">this</span>._acquireCursor(valueOrDefault(dir, NO_DIRECTION))) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>; 
  <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>.shiftClick(<span style="color: #8b1a1a;">this</span>._cursor);
};
</pre>
</div>

<p>
The <code>_acquireCursor(dir)</code> function returns the current cursor if it is
not <code>undefined</code>; otherwise it sets the cursor to a default value obtained
from the selection geometry; the default of that default is
<code>undefined</code>.  The <code>dir</code> parameter is one of <code>UP</code>, <code>DOWN</code>, <code>LEFT</code>, <code>RIGHT</code>
when called from the arrow functions and <code>NO_DIRECTION</code> when called
from the space functions.  The purpose of the <code>dir</code> parameter is to allow for a
different default for different arrow keys. For example, the default
for down arrow could be a point indicating the first index, and up arrow the last.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-acquire-cursor">  SelectionState.<span style="color: #8b1a1a;">prototype</span>._acquireCursor = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>) {
    <span style="color: #8b1a1a;">this</span>._cursor = valueOrDefault(<span style="color: #8b1a1a;">this</span>._cursor, <span style="color: #8b1a1a;">this</span>._geometry.defaultCursor(dir));
    <span style="color: #0000FF;">return</span> !(<span style="color: #8b1a1a;">this</span>._noCursor());
  }
  SelectionState.<span style="color: #8b1a1a;">prototype</span>._noCursor = <span style="color: #0000FF;">function</span> () { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>._cursor === <span style="color: #8b1a1a;">undefined</span>; }
</pre>
</div>

<p>
Note that the client calls <code>space</code>, <code>cmdSpace</code>, or <code>shiftSpace</code>
without an argument, and thus <code>dir</code> is undefined. Thus, if <code>_cursor</code> is
not defined, the default is queried with <code>NO_DIRECTION</code>. The arrow
methods call the <code>cmdSpace</code> and <code>shiftSpace</code> methods with a direction
argument, and therefore the default is queried with that direction
value.
</p>

<p>
The arrow methods are as follows:
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-state-arrow-functions">SelectionState.<span style="color: #8b1a1a;">prototype</span>.arrow = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>) {
  <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._noCursor()) { <span style="color: #8b1a1a;">this</span>._acquireCursor(dir); <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>; }
  <span style="color: #8b1a1a;">this</span>._cursor = <span style="color: #8b1a1a;">this</span>._geometry.step(dir, <span style="color: #8b1a1a;">this</span>._cursor);
  <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>;
}
SelectionState.<span style="color: #8b1a1a;">prototype</span>.cmdArrow = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>) {
  <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._noCursor()) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>.cmdSpace(dir);
  <span style="color: #0000FF;">else</span> <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>.cmdSpace(dir).arrow(dir);
};
SelectionState.<span style="color: #8b1a1a;">prototype</span>.shiftArrow = <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>) {
  <span style="color: #0000FF;">if</span> (<span style="color: #8b1a1a;">this</span>._noCursor()) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>.shiftSpace(dir);
  <span style="color: #0000FF;">else</span> <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">this</span>.arrow(dir).shiftSpace(dir);
}
</pre>
</div>

<p>
In all three arrow methods, if the cursor is undefined
the cursor position is taken to be whatever default the 
geometry provides. Shift-arrow does not move the 
cursor before the <code>shiftSpace</code> call and command-arrow 
does not move it after the <code>cmdSpace</code> call. This seems like
the most natural behavior.
</p>
</div>
</div>
</div>
