org/multiselect_library.org
* Selection geometries
  :PROPERTIES:
  :CUSTOM_ID: sec-selection-geometries
  :END:

Aspects of selection that vary from one context to another are bundled
into a /selection geometry/ object.  The library provides the
~DefaultGeometry~ class, from which different geometry
classes can inherit. 

#+NAME: default-geometry
#+BEGIN_SRC js
<<set-and-map-functions>>

var DefaultGeometry = function () {};

DefaultGeometry.prototype = {
  m2v : function (mp) { return mp; },
  extendPath : function (spath, vp) { spath.push(vp); },
  step : function (dir, vp) { return undefined; },
  selectionDomain : function(spath, J) { 
    var m = makeEmptyMap();
    for (var i of spath) m.set(i, true); 
    return m;
  },
  defaultCursor : function(dir) { return undefined; },
  filter : undefined
};
#+END_SRC

The functions of a selection geometry are:

  # - ~ordered()~
  #   - Returns true if there is a total order for the indices $I$, 
  #     such that ~selectionDomain~ always returns a contiguous subsequence of
  #     indices drawn from $I$ considered as a sequence, 
  #     ordered according to that total order. 
  #     Coordinate systems for representing vertical and horizontal lists, and row-wise 
  #     ordered text have this property.
      
  - ~m2v(mpoint)~
    - Transforms a point in the client's coordinate system (e.g., the
      mouse coordinate system) to a coordinate in the selection space
      (see Section 3.2.3 in the manuscript).
      In the default geometry this mapping is an identity.

  - ~extendPath(spath, p)~
    - Extends the selection path with a new point (as a response to a
      shift-click). The function modifies the ~spath~ argument.  The
      return value ~null~ indicates that ~p~ did not affect ~spath~.
#      The default geometry ignores ~null~ values and limits the path
#      size to two---the anchor and the active end.

  - ~step(dir, vp)~
    - Given a direction ~dir~ and a selection space coordinate ~vp~,
      computes a new selection space coordinate to be used as the new keyboard
      cursor location. The possible values of ~dir~ are ~UP~, ~DOWN~, ~LEFT~, 
      and ~RIGHT~, defined in and exported from the multiselect module. 
      (The ~step~ function is never called with ~NO_DIRECTION~.)

      #+NAME: geometry-directions
      #+BEGIN_SRC js :exports none
        var UP = 1, DOWN = 2, LEFT = 3, RIGHT = 4, NO_DIRECTION = 0;
      #+END_SRC

      The default is ~undefined~, which means that no keyboard commands 
      have any effect.

  - ~selectionDomain(spath, J)~
    - Computes the selection domain, a set of indices (represented as
      a ~Map~; only the keys matter, values are insignificant), from
      the ~spath~ array of selection space points.  The first element
      in this array is the /anchor/, the last the /active end/.  The
      helper functions ~anchor~ and ~activeEnd~, part of the
      multiselect module's API, extract these values. Often only these
      elements are relevant for determining the selection domain.

      #+NAME: geometry-utilities
      #+BEGIN_SRC js
        function anchor(path) { 
           if (path.length === 0) return undefined; 
           return path[0]; 
        };
        function activeEnd(path) { 
           if (path.length === 0) return undefined; 
           return path[path.length - 1]; 
        };
      #+END_SRC

      The ~J~ argument is defined when
      ~selectionDomain~ is called from ~SelectionState~'s ~shiftClick~
      or ~setPath~ methods and it is a second consecutive call
      from the same method, otherwise they are both undefined. 
      # The
      # ~source~ parameter is either ~C_SHIFT_CLICK~ or ~C_SET_PATH~, identifying
      # the caller. 
      ~J~'s value is then the current selection domain (computed
      by the most recent preceding call to ~selectionDomain~).
      The purpose of this parameter is to allow the selection domain computation
      to take advantage of the results of the previous computation and in this way
      compute a new selection domain faster.
   
      Both shift-click and set-path commands schedule the operation
      to a one-element long queue, so that the selection path can be modified
      several times between two consequtive calls to ~selectionDomain~. 
#      The library
#      guarantees that if ~source~ is ~C_SHIFT_CLICK~,
#     the previous call to ~selectionDomain~ was from the ~shiftClick~ method.
#     The analogous guarantee holds for the ~C_SET_PATH~ value and ~setPath~ method.

      A skeleton for how to take advantage of ~J~ and ~source~ 
      is below. Note that it is not necessary to take a copy of ~J~;
      it can be modified in-place.

      #+NAME: selection-domain-skeleton
      #+BEGIN_SRC js
      selectionDomain = function(spath, J) { 
        if (J !== undefined) {
          J = makeEmptyMap(); 
          // clear cache
          // populate J from scratch, start caching
        } else {
          // modify J based on cache
        }
        return J;
      #+END_SRC


      # #+NAME: selection-domain-skeleton
      # #+BEGIN_SRC js
      # selectionDomain = function(spath, source, J) { 
      #   shift (source) {
      #     case C_SHIFT_CLICK:                      
      #       // modify J based on shift click cache
      #       break;
      #     case C_SET_PATH:
      #       // modify J based on set path cache
      #       break;
      #     default: 
      #       J = makeEmptyMap();           
      #       // clear cache for shift-clicks
      #       // clear cache for set path
      #       // populate J from scratch
      #   }
      #   return J;
      # #+END_SRC

   - If ~spath~ has exactly one element, call it $p$, the computed
      selection domain should have at most one element. In selection 
      geometries that allow overlapping elements, one might for example
      return the singleton set consisting of the index of the topmost
      element under $p$.  This requirement is not strict---nothing
      breaks if it is not followed, but the selection behavior might
      be unconventional since in most applications clicks and
      command-clicks can only select one element at a time.

   - The default geometry defines ~selectionDomain~ to map the path elements
     to the elements of the selection domain.

  - ~defaultCursor(dir)~
    - The ~defaultCursor(dir)~ function provides default values for
      the keyboard cursor.  It is called from either the space or
      arrow methods, when no cursor has yet been established (e.g., by
      some click command).  When called as a result of pressing one of
      the arrow keys, ~defaultCursor~ receives the parameter ~dir~ to
      indicate which arrow key was pressed---the default may depend on
      the key. For example, in a horizontally stacked sequentially
      ordered elements, the down-arrow could start at the topmost
      element, whereas the up-arrow from the bottom element.  When
      ~defaultCursor(dir)~ is called as a result of pressing space,
      ~dir~ has value ~NO_DIRECTION~.  It is fine to return
      ~undefined~ from ~defaultCursor(dir)~; nothing breaks, except that 
      there will be no default values.
  

  # - ~boundToElement(vpoint)~
  #   - If a selection space point is bound to an element (~v2i(vpoint)
  #     !== undefined~), returns true, otherwise false.

  #     When re-positioning elements in the client view, e.g., as a result of a window resizing
  #     or change of elements' sorting order, the selection domain computed from 
  #     the current selection path may change and thus the path should be discarded.
  #     In some coordinate systems points on the selection path,
  #     can be bound to an element, and thus
  #     re-position along with the element they are bound to.


