dist-docs/library/multiselect_library.html

<div id="outline-container-sec-selection-geometries" class="outline-2">
<h2 id="sec-selection-geometries"><a id="sec-7"></a><span class="section-number-2">7</span> Selection geometries</h2>
<div class="outline-text-2" id="text-sec-selection-geometries">
<p>
Aspects of selection that vary from one context to another are bundled
into a <i>selection geometry</i> object.  The library provides the
<code>DefaultGeometry</code> class, from which different geometry
classes can inherit.  
</p>

<div class="org-src-container">

<pre class="src src-js" id="default-geometry"><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">DefaultGeometry</span> = <span style="color: #0000FF;">function</span> () {};

<span style="color: #6434A3;">DefaultGeometry</span>.<span style="color: #8b1a1a;">prototype</span> = {
  <span style="color: #006699;">m2v</span> : <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">mp</span>) { <span style="color: #0000FF;">return</span> mp; },
  <span style="color: #006699;">extendPath</span> : <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">spath</span>, <span style="color: #BA36A5;">vp</span>) { 
    <span style="color: #0000FF;">if</span> (vp === <span style="color: #8b1a1a;">null</span>) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">null</span>;
    <span style="color: #0000FF;">if</span> (spath.length == 2) spath[1] = vp; <span style="color: #0000FF;">else</span> spath.push(vp); 
  }, 
  <span style="color: #006699;">step</span> : <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>, <span style="color: #BA36A5;">vp</span>) { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">undefined</span>; },
  <span style="color: #006699;">selectionDomain</span> : <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">spath</span>, <span style="color: #BA36A5;">source</span>, <span style="color: #BA36A5;">J</span>) { 
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">m</span> = makeEmptyMap();
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of spath) m.set(i, <span style="color: #8b1a1a;">true</span>); 
    <span style="color: #0000FF;">return</span> m;
  },
  <span style="color: #006699;">defaultCursor</span> : <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">dir</span>) { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">undefined</span>; },
  filter : <span style="color: #8b1a1a;">undefined</span>
};
</pre>
</div>

<p>
The functions of a selection geometry are:
</p>

<ul class="org-ul">
<li><code>m2v(mpoint)</code>
<ul class="org-ul">
<li>Transforms a point in the client&rsquo;s coordinate system (e.g., the
mouse coordinate system) to a coordinate in the selection space
(see Section 3.2.3 in the manuscript).
In the default geometry this mapping is an identity.</li>
</ul></li>

<li><code>extendPath(spath, p)</code>
<ul class="org-ul">
<li>Extends the selection path with a new point (as a response to a
shift-click). The function modifies the <code>spath</code> argument.  The
return value <code>null</code> indicates that <code>p</code> did not affect <code>spath</code>.
The default geometry ignores <code>null</code> values and limits the path
size to two&#x2014;the anchor and the active end.</li>
</ul></li>

<li><code>step(dir, vp)</code>
<ul class="org-ul">
<li><p>
Given a direction <code>dir</code> and a selection space coordinate <code>vp</code>,
computes a new selection space coordinate to be used as the new keyboard
cursor location. The possible values of <code>dir</code> are <code>UP</code>, <code>DOWN</code>, <code>LEFT</code>, 
and <code>RIGHT</code>, defined in and exported from the multiselect module. 
(The <code>step</code> function is never called with <code>NO_DIRECTION</code>.)
</p>

<p>
The default is <code>undefined</code>, which means that no keyboard commands 
have any effect.
</p></li>
</ul></li>

<li><p>
<code>selectionDomain(spath, source, J)</code>
</p>
<ul class="org-ul">
<li><p>
Computes the selection domain, a set of indices (represented as
a <code>Map</code>; only the keys matter, values are insignificant), from
the <code>spath</code> array of selection space points.  The first element
in this array is the <i>anchor</i>, the last the <i>active end</i>.  The
helper functions <code>anchor</code> and <code>activeEnd</code>, part of the
multiselect module&rsquo;s API, extract these values. Often only these
elements are relevant for determining the selection domain.
</p>

<div class="org-src-container">

<pre class="src src-js" id="geometry-utilities">  <span style="color: #0000FF;">function</span> <span style="color: #006699;">anchor</span>(<span style="color: #BA36A5;">path</span>) { 
     <span style="color: #0000FF;">if</span> (path.length === 0) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">undefined</span>; 
     <span style="color: #0000FF;">return</span> path[0]; 
  };
  <span style="color: #0000FF;">function</span> <span style="color: #006699;">activeEnd</span>(<span style="color: #BA36A5;">path</span>) { 
     <span style="color: #0000FF;">if</span> (path.length === 0) <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">undefined</span>; 
     <span style="color: #0000FF;">return</span> path[path.length - 1]; 
  };
</pre>
</div>

<p>
The <code>source</code> and <code>J</code> are defined when
<code>selectionDomain</code> is called from <code>SelectionState</code>&rsquo;s <code>shiftClick</code>
or <code>setPath</code> methods and it is a second consecutive call
from the same method, otherwise they are both undefined. The
<code>source</code> parameter is either <code>C_SHIFT_CLICK</code> or <code>C_SET_PATH</code>, identifying
the caller. The <code>J</code> parameter is the current selection domain (computed
by the most recent preceding call to <code>selectionDomain</code>).
These two parameters are there so that the selection domain computation
can take advantage of the results of the previous computation; in some selection
geometries this can lead to notably more efficient implementations.
</p>

<p>
Both shift-click and set-path commands schedule the operation
to a one-element long queue, so that the selection path can be modified
several times between calls to <code>selectionDomain</code>. The library
guarantees that if <code>source</code> is <code>C_SHIFT_CLICK</code>,
the previous call to <code>selectionDomain</code> was from the <code>shiftClick</code> method.
The analogous guarantee holds for the <code>C_SET_PATH</code> value and <code>setPath</code> method.
</p>

<p>
A skeleton for how to take advantage of <code>J</code> and <code>source</code> 
is below. Note that it is not necessary to take a copy of <code>J</code>;
it can be modified in-place.
</p>

<div class="org-src-container">

<pre class="src src-js" id="selection-domain-skeleton">selectionDomain = <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">spath</span>, <span style="color: #BA36A5;">source</span>, <span style="color: #BA36A5;">J</span>) { 
  shift (source) {
    <span style="color: #0000FF;">case</span> C_SHIFT_CLICK:                      
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">modify J based on shift click cache</span>
      <span style="color: #0000FF;">break</span>;
    <span style="color: #0000FF;">case</span> C_SET_PATH:
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">modify J based on set path cache</span>
      <span style="color: #0000FF;">break</span>;
    <span style="color: #0000FF;">default</span>: 
      J = makeEmptyMap();           
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">clear cache for shift-clicks</span>
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">clear cache for set path</span>
      <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">populate J from scratch</span>
  }
  <span style="color: #0000FF;">return</span> J;
</pre>
</div></li>
</ul>
<ul class="org-ul">
<li>If <code>spath</code> has exactly one element, call it \(p\), the computed
selection domain should have at most one element. In selection 
geometries that allow overlapping elements, one might for example
return the singleton set consisting of the index of the topmost
element under \(p\).  This requirement is not strict&#x2014;nothing
breaks if it is not followed, but the selection behavior might
be unconventional since in most applications clicks and
command-clicks can only select one element at a time.</li>

<li>The default geometry defines <code>selectionDomain</code> to map the path elements
to the elements of the selection domain.</li>
</ul></li>

<li><code>defaultCursor(dir)</code>
<ul class="org-ul">
<li>The <code>defaultCursor(dir)</code> function provides default values for
the keyboard cursor.  It is called from either the space or
arrow methods, when no cursor has yet been established (e.g., by
some click command).  When called as a result of pressing one of
the arrow keys, <code>defaultCursor</code> receives the parameter <code>dir</code> to
indicate which arrow key was pressed&#x2014;the default may depend on
the key. For example, in a horizontally stacked sequentially
ordered elements, the down-arrow could start at the topmost
element, whereas the up-arrow from the bottom element.  When
<code>defaultCursor(dir)</code> is called as a result of pressing space,
<code>dir</code> has value <code>NO_DIRECTION</code>.  It is fine to return
<code>undefined</code> from <code>defaultCursor(dir)</code>; nothing breaks, except that 
there will be no default values.</li>
</ul></li>
</ul>
</div>
</div>
